alpelectronix/RP2040-ESP32C3-Development-Board/RP2040-ESP32C3_Dev_Board/SLG46826/I2C_SLG46826_REG.h
#ifndef __I2C_SLG46826_REG_H__
#define __I2C_SLG46826_REG_H__

typedef struct {
  union {
    struct {
      union {
        uint8_t reg_00;
      };
      union {
        uint8_t reg_01;
      };
      union {
        uint8_t reg_02;
      };
      union {
        uint8_t reg_03;
      };
      union {
        uint8_t reg_04;
      };
      union {
        uint8_t reg_05;
      };
      union {
        uint8_t reg_06;
      };
      union {
        uint8_t reg_07;
      };
      union {
        uint8_t reg_08;
      };
      union {
        uint8_t reg_09;
      };
      union {
        uint8_t reg_0a;
      };
      union {
        uint8_t reg_0b;
      };
      union {
        uint8_t reg_0c;
      };
      union {
        uint8_t reg_0d;
      };
      union {
        uint8_t reg_0e;
      };
      union {
        uint8_t reg_0f;
      };
      union {
        uint8_t reg_10;
      };
      union {
        uint8_t reg_11;
      };
      union {
        uint8_t reg_12;
      };
      union {
        uint8_t reg_13;
      };
      union {
        uint8_t reg_14;
      };
      union {
        uint8_t reg_15;
      };
      union {
        uint8_t reg_16;
      };
      union {
        uint8_t reg_17;
      };
      union {
        uint8_t reg_18;
      };
      union {
        uint8_t reg_19;
      };
      union {
        uint8_t reg_1a;
      };
      union {
        uint8_t reg_1b;
      };
      union {
        uint8_t reg_1c;
      };
      union {
        uint8_t reg_1d;
      };
      union {
        uint8_t reg_1e;
      };
      union {
        uint8_t reg_1f;
      };
      union {
        uint8_t reg_20;
      };
      union {
        uint8_t reg_21;
      };
      union {
        uint8_t reg_22;
      };
      union {
        uint8_t reg_23;
      };
      union {
        uint8_t reg_24;
      };
      union {
        uint8_t reg_25;
      };
      union {
        uint8_t reg_26;
      };
      union {
        uint8_t reg_27;
      };
      union {
        uint8_t reg_28;
      };
      union {
        uint8_t reg_29;
      };
      union {
        uint8_t reg_2a;
      };
      union {
        uint8_t reg_2b;
      };
      union {
        uint8_t reg_2c;
      };
      union {
        uint8_t reg_2d;
      };
      union {
        uint8_t reg_2e;
      };
      union {
        uint8_t reg_2f;
      };
      union {
        uint8_t reg_30;
      };
      union {
        uint8_t reg_31;
      };
      union {
        uint8_t reg_32;
      };
      union {
        uint8_t reg_33;
      };
      union {
        uint8_t reg_34;
      };
      union {
        uint8_t reg_35;
      };
      union {
        uint8_t reg_36;
      };
      union {
        uint8_t reg_37;
      };
      union {
        uint8_t reg_38;
      };
      union {
        uint8_t reg_39;
      };
      union {
        uint8_t reg_3a;
      };
      union {
        uint8_t reg_3b;
      };
      union {
        uint8_t reg_3c;
      };
      union {
        uint8_t reg_3d;
      };
      union {
        uint8_t reg_3e;
      };
      union {
        uint8_t reg_3f;
      };
      union {
        uint8_t reg_40;
      };
      union {
        uint8_t reg_41;
      };
      union {
        uint8_t reg_42;
      };
      union {
        uint8_t reg_43;
      };
      union {
        uint8_t reg_44;
      };
      union {
        uint8_t reg_45;
      };
      union {
        uint8_t reg_46;
      };
      union {
        uint8_t reg_47;
      };
      union {
        uint8_t reg_48;
      };
      union {
        uint8_t reg_49;
      };
      union {
        uint8_t reg_4a;
      };
      union {
        uint8_t reg_4b;
      };
      union {
        uint8_t reg_4c;
      };
      union {
        uint8_t reg_4d;
      };
      union {
        uint8_t reg_4e;
      };
      union {
        uint8_t reg_4f;
      };
      union {
        uint8_t reg_50;
      };
      union {
        uint8_t reg_51;
      };
      union {
        uint8_t reg_52;
      };
      union {
        uint8_t reg_53;
      };
      union {
        uint8_t reg_54;
      };
      union {
        uint8_t reg_55;
      };
      union {
        uint8_t reg_56;
      };
      union {
        uint8_t reg_57;
      };
      union {
        uint8_t reg_58;
      };
      union {
        uint8_t reg_59;
      };
      union {
        uint8_t reg_5a;
      };
      union {
        uint8_t reg_5b;
      };
      union {
        uint8_t reg_5c;
      };
      union {
        uint8_t reg_5d;
      };
      union {
        uint8_t reg_5e;
      };
      union {
        uint8_t reg_5f;
      };
      union {
        struct {
          uint8_t io_fast_pull_up_down_enable: 1; // [60H(0), 768:768]
          uint8_t i2c_mode_selection: 1;          // [60H(1), 769:769]
        };
        uint8_t reg_60;
      };
      union {
        struct {
          uint8_t io0_input_mode_configuration: 2;          // [61H(0), 777:776]
          uint8_t io0_output_mode_configuration: 2;         // [61H(2), 779:778]
          uint8_t io0_pull_up_down_resistance_selection: 2; // [61H(4), 781:780]
          uint8_t io0_pull_up_down_selection: 1;            // [61H(6), 782:782]
          uint8_t io0_output_enable: 1;                     // [61H(7), 783:783]
        };
        uint8_t reg_61;
      };
      union {
        struct {
          uint8_t io1_input_mode_configuration: 2;          // [62H(0), 785:784]
          uint8_t io1_output_mode_configuration: 2;         // [62H(2), 787:786]
          uint8_t io1_pull_up_down_resistance_selection: 2; // [62H(4), 789:788]
          uint8_t io1_pull_up_down_selection: 1;            // [62H(6), 790:790]
        };
        uint8_t reg_62;
      };
      union {
        uint8_t reg_63;
      };
      union {
        struct {
          uint8_t io2_input_mode_configuration: 2;          // [64H(0), 801:800]
          uint8_t io2_output_mode_configuration: 2;         // [64H(2), 803:802]
          uint8_t io2_pull_up_down_resistance_selection: 2; // [64H(4), 805:804]
          uint8_t io2_pull_up_down_selection: 1;            // [64H(6), 806:806]
          uint8_t io2_output_enable: 1;                     // [64H(7), 807:807]
        };
        uint8_t reg_64;
      };
      union {
        struct {
          uint8_t io3_input_mode_configuration: 2;          // [65H(0), 809:808]
          uint8_t io3_output_mode_configuration: 2;         // [65H(2), 811:810]
          uint8_t io3_pull_up_down_resistance_selection: 2; // [65H(4), 813:812]
          uint8_t io3_pull_up_down_selection: 1;            // [65H(6), 814:814]
          uint8_t io3_output_enable: 1;                     // [65H(7), 815:815]
        };
        uint8_t reg_65;
      };
      union {
        struct {
          uint8_t io4_input_mode_configuration: 2;          // [66H(0), 817:816]
          uint8_t io4_output_mode_configuration: 2;         // [66H(2), 819:818]
          uint8_t io4_pull_up_down_resistance_selection: 2; // [66H(4), 821:820]
          uint8_t io4_pull_up_down_selection: 1;            // [66H(6), 822:822]
        };
        uint8_t reg_66;
      };
      union {
        struct {
          uint8_t io5_input_mode_configuration: 2;          // [67H(0), 825:824]
          uint8_t io5_output_mode_configuration: 2;         // [67H(2), 827:826]
          uint8_t io5_pull_up_down_resistance_selection: 2; // [67H(4), 829:828]
          uint8_t io5_pull_up_down_selection: 1;            // [67H(6), 830:830]
        };
        uint8_t reg_67;
      };
      union {
        struct {
          uint8_t : 1;                                      // [68H(0), 832:832]
          uint8_t scl_input_mode_configuration: 2;          // [68H(1), 834:833]
          uint8_t scl_pull_up_down_resistance_selection: 2; // [68H(3), 836:835]
        };
        uint8_t reg_68;
      };
      union {
        struct {
          uint8_t : 1;                                      // [69H(0), 840:840]
          uint8_t sda_input_mode_configuration: 2;          // [69H(1), 842:841]
          uint8_t sda_pull_up_down_resistance_selection: 2; // [69H(3), 844:843]
        };
        uint8_t reg_69;
      };
      union {
        struct {
          uint8_t : 2;                                      // [6AH(0), 849:848]
          uint8_t io6_output_mode_configuration: 2;         // [6AH(2), 851:850]
          uint8_t io6_pull_up_down_resistance_selection: 2; // [6AH(4), 853:852]
          uint8_t io6_pull_up_down_selection: 1;            // [6AH(6), 854:854]
          uint8_t io6_output_enable: 1;                     // [6AH(7), 855:855]
        };
        uint8_t reg_6a;
      };
      union {
        struct {
          uint8_t : 2;                                      // [6BH(0), 857:856]
          uint8_t io7_output_mode_configuration: 2;         // [6BH(2), 859:858]
          uint8_t io7_pull_up_down_resistance_selection: 2; // [6BH(4), 861:860]
          uint8_t io7_pull_up_down_selection: 1;            // [6BH(6), 862:862]
          uint8_t io7_output_enable: 1;                     // [6BH(7), 863:863]
        };
        uint8_t reg_6b;
      };
      union {
        struct {
          uint8_t io8_input_mode_configuration: 2;          // [6CH(0), 865:864]
          uint8_t io8_output_mode_configuration: 2;         // [6CH(2), 867:866]
          uint8_t io8_pull_up_down_resistance_selection: 2; // [6CH(4), 869:868]
          uint8_t io8_pull_up_down_selection: 1;            // [6CH(6), 870:870]
        };
        uint8_t reg_6c;
      };
      union {
        uint8_t reg_6d;
      };
      union {
        struct {
          uint8_t io9_input_mode_configuration: 2;          // [6EH(0), 881:880]
          uint8_t io9_output_mode_configuration: 2;         // [6EH(2), 883:882]
          uint8_t io9_pull_up_down_resistance_selection: 2; // [6EH(4), 885:884]
          uint8_t io9_pull_up_down_selection: 1;            // [6EH(6), 886:886]
        };
        uint8_t reg_6e;
      };
      union {
        struct {
          uint8_t io10_input_mode_configuration: 2;           // [6FH(0), 889:888]
          uint8_t io10_output_mode_configuration: 2;          // [6FH(2), 891:890]
          uint8_t io10_pull_up_down_resistance_selection: 2;  // [6FH(4), 893:892]
          uint8_t io10_pull_up_down_selection: 1;             // [6FH(6), 894:894]
        };
        uint8_t reg_6f;
      };
      union {
        struct {
          uint8_t io11_input_mode_configuration: 2;           // [70H(0), 897:896]
          uint8_t io11_output_mode_configuration: 2;          // [70H(2), 899:898]
          uint8_t io11_pull_up_down_resistance_selection: 2;  // [70H(4), 901:900]
          uint8_t io11_pull_up_down_selection: 1;             // [70H(6), 902:902]
        };
        uint8_t reg_70;
      };
      union {
        struct {
          uint8_t io12_input_mode_configuration: 2;           // [71H(0), 905:904]
          uint8_t io12_output_mode_configuration: 2;          // [71H(2), 907:906]
          uint8_t io12_pull_up_down_resistance_selection: 2;  // [71H(4), 909:908]
          uint8_t io12_pull_up_down_selection: 1;             // [71H(6), 910:910]
        };
        uint8_t reg_71;
      };
      union {
        struct {
          uint8_t io13_input_mode_configuration: 2;           // [72H(0), 913:912]
          uint8_t io13_output_mode_configuration: 2;          // [72H(2), 915:914]
          uint8_t io13_pull_up_down_resistance_selection: 2;  // [72H(4), 917:916]
          uint8_t io13_pull_up_down_selection: 1;             // [72H(6), 918:918]
        };
        uint8_t reg_72;
      };
      union {
        struct {
          uint8_t io14_input_mode_configuration: 2;           // [73H(0), 921:920]
          uint8_t io14_output_mode_configuration: 2;          // [73H(2), 923:922]
          uint8_t io14_pull_up_down_resistance_selection: 2;  // [73H(4), 925:924]
          uint8_t io14_pull_up_down_selection: 1;             // [73H(6), 926:926]
        };
        uint8_t reg_73;
      };
      union {
        struct {
          uint8_t : 1;                  // [74H(0), 928:928]
          uint8_t io0_digital_input: 1; // [74H(1), 929:929]
          uint8_t io1_digital_input: 1; // [74H(2), 930:930]
          uint8_t io2_digital_input: 1; // [74H(3), 931:931]
          uint8_t io3_digital_input: 1; // [74H(4), 932:932]
          uint8_t io4_digital_input: 1; // [74H(5), 933:933]
          uint8_t io5_digital_input: 1; // [74H(6), 934:934]
          uint8_t io8_digital_input: 1; // [74H(7), 935:935]
        };
        uint8_t reg_74;
      };
      union {
        struct {
          uint8_t io9_digital_input: 1;   // [75H(0), 936:936]
          uint8_t io10_digital_input: 1;  // [75H(1), 937:937]
          uint8_t io11_digital_input: 1;  // [75H(2), 938:938]
          uint8_t io12_digital_input: 1;  // [75H(3), 939:939]
          uint8_t io13_digital_input: 1;  // [75H(4), 940:940]
          uint8_t io14_digital_input: 1;  // [75H(5), 941:941]
          uint8_t lut2_0_dff0_out: 1;     // [75H(6), 942:942]
          uint8_t lut2_1_dff1_out: 1;     // [75H(7), 943:943]
        };
        uint8_t reg_75;
      };
      union {
        struct {
          uint8_t lut2_2_dff2_out: 1; // [76H(0), 944:944]
          uint8_t lut2_3_pgen_out: 1; // [76H(1), 945:945]
          uint8_t lut3_0_dff3_out: 1; // [76H(2), 946:946]
          uint8_t lut3_1_dff4_out: 1; // [76H(3), 947:947]
          uint8_t lut3_2_dff5_out: 1; // [76H(4), 948:948]
          uint8_t lut3_3_dff6_out: 1; // [76H(5), 949:949]
          uint8_t lut3_4_dff7_out: 1; // [76H(6), 950:950]
          uint8_t lut3_5_dff8_out: 1; // [76H(7), 951:951]
        };
        uint8_t reg_76;
      };
      union {
        struct {
          uint8_t lut3_6_pipedly_ripp_cnt_out0: 1;    // [77H(0), 952:952]
          uint8_t pipedly_ripp_cnt_out1: 1;           // [77H(1), 953:953]
          uint8_t ripp_cnt_out2: 1;                   // [77H(2), 954:954]
          uint8_t edet_filter_out: 1;                 // [77H(3), 955:955]
          uint8_t prog_dly_edet_out: 1;               // [77H(4), 956:956]
          uint8_t multfunc_8bit_1_dly_cnt_out: 1;     // [77H(5), 957:957]
          uint8_t ckosc1_matrix_osc1_matrix_input: 1; // [77H(6), 958:958]
          uint8_t ckosc0_matrix_osc0_matrix_input: 1; // [77H(7), 959:959]
        };
        uint8_t reg_77;
      };
      union {
        struct {
          uint8_t ckosc2_matrix_osc2_matrix_input: 1; // [78H(0), 960:960]
          uint8_t multfunc_8bit_2_dly_cnt_out: 1;     // [78H(1), 961:961]
          uint8_t multfunc_8bit_3_dly_cnt_out: 1;     // [78H(2), 962:962]
          uint8_t multfunc_8bit_4_dly_cnt_out: 1;     // [78H(3), 963:963]
          uint8_t multfunc_8bit_5_dly_cnt_out: 1;     // [78H(4), 964:964]
          uint8_t multfunc_8bit_6_dly_cnt_out: 1;     // [78H(5), 965:965]
          uint8_t multfunc_8bit_7_dly_cnt_out: 1;     // [78H(6), 966:966]
          uint8_t multfunc_16bit_0_lut_dff_out: 1;    // [78H(7), 967:967]
        };
        uint8_t reg_78;
      };
      union {
        struct {
          uint8_t multfunc_8bit_1_lut_dff_out: 1;   // [79H(0), 968:968]
          uint8_t multfunc_8bit_2_lut_dff_out: 1;   // [79H(1), 969:969]
          uint8_t multfunc_8bit_3_lut_dff_out: 1;   // [79H(2), 970:970]
          uint8_t multfunc_8bit_4_lut_dff_out: 1;   // [79H(3), 971:971]
          uint8_t multfunc_8bit_5_lut_dff_out: 1;   // [79H(4), 972:972]
          uint8_t multfunc_8bit_6_lut_dff_out: 1;   // [79H(5), 973:973]
          uint8_t multfunc_8bit_7_lut_dff_out: 1;   // [79H(6), 974:974]
          uint8_t multfunc_16bit_0_dly_cnt_out: 1;  // [79H(7), 975:975]
        };
        uint8_t reg_79;
      };
      union {
        struct {
          uint8_t virtual_input_7: 1; // [7AH(0), 976:976]
          uint8_t virtual_input_6: 1; // [7AH(1), 977:977]
          uint8_t virtual_input_5: 1; // [7AH(2), 978:978]
          uint8_t virtual_input_4: 1; // [7AH(3), 979:979]
          uint8_t virtual_input_3: 1; // [7AH(4), 980:980]
          uint8_t virtual_input_2: 1; // [7AH(5), 981:981]
          uint8_t virtual_input_1: 1; // [7AH(6), 982:982]
          uint8_t virtual_input_0: 1; // [7AH(7), 983:983]
        };
        uint8_t reg_7a;
      };
      union {
        struct {
          uint8_t : 1;                      // [7BH(0), 984:984]
          uint8_t : 1;                      // [7BH(1), 985:985]
          uint8_t acmp0l_out: 1;            // [7BH(2), 986:986]
          uint8_t acmp1l_out: 1;            // [7BH(3), 987:987]
          uint8_t second_ckosc1_matrix: 1;  // [7BH(4), 988:988]
          uint8_t second_ckosc0_matrix: 1;  // [7BH(5), 989:989]
          uint8_t por_core: 1;              // [7BH(6), 990:990]
        };
        uint8_t reg_7b;
      };
      union {
        struct {
          uint8_t cnt0_counted_value_7_0: 8; // [7CH(0), 999:992]
        };
        uint8_t reg_7c;
      };
      union {
        struct {
          uint8_t cnt0_counted_value_15_8: 8; // [7DH(0), 1007:1000]
        };
        uint8_t reg_7d;
      };
      union {
        struct {
          uint8_t cnt2_counted_value: 8; // [7EH(0), 1015:1008]
        };
        uint8_t reg_7e;
      };
      union {
        struct {
          uint8_t cnt4_counted_value: 8; // [7FH(0), 1023:1016]
        };
        uint8_t reg_7f;
      };
      union {
        struct {
          uint8_t osc1_turn_on_by_register: 1;            // [80H(0), 1024:1024]
          uint8_t osc1_matrix_power_down_or_on_select: 1; // [80H(1), 1025:1025]
          uint8_t osc1_external_clock_source_enable: 1;   // [80H(2), 1026:1026]
          uint8_t osc1_post_divider_ration_control: 2;    // [80H(3), 1028:1027]
          uint8_t osc1_matrix_divider_ratio_control: 3;   // [80H(5), 1031:1029]
        };
        uint8_t reg_80;
      };
      union {
        struct {
          uint8_t osc2_turn_on_by_register: 1;            // [81H(0), 1032:1032]
          uint8_t osc2_matrix_power_down_or_on_select: 1; // [81H(1), 1033:1033]
          uint8_t osc2_external_clock_source_enable: 1;   // [81H(2), 1034:1034]
          uint8_t osc2_post_divider_ration_control: 2;    // [81H(3), 1036:1035]
          uint8_t osc2_matrix_divider_ratio_control: 3;   // [81H(5), 1039:1037]
        };
        uint8_t reg_81;
      };
      union {
        struct {
          uint8_t osc0_turn_on_by_register: 1;            // [82H(0), 1040:1040]
          uint8_t osc0_matrix_power_down_or_on_select: 1; // [82H(1), 1041:1041]
          uint8_t osc0_external_clock_source_enable: 1;   // [82H(2), 1042:1042]
          uint8_t osc0_post_divider_ration_control: 2;    // [82H(3), 1044:1043]
          uint8_t osc0_matrix_divider_ratio_control: 3;   // [82H(5), 1047:1045]
        };
        uint8_t reg_82;
      };
      union {
        struct {
          uint8_t : 1;                            // [83H(0), 1048:1048]
          uint8_t osc0_matrix_out_enable: 1;      // [83H(1), 1049:1049]
          uint8_t osc1_matrix_out_enable: 1;      // [83H(2), 1050:1050]
          uint8_t osc2_matrix_out_enable: 1;      // [83H(3), 1051:1051]
          uint8_t osc2_100_ns_startup_delay: 1;   // [83H(4), 1052:1052]
          uint8_t osc0_2nd_matrix_out_enable: 1;  // [83H(5), 1053:1053]
          uint8_t osc1_2nd_matrix_out_enable: 1;  // [83H(6), 1054:1054]
        };
        uint8_t reg_83;
      };
      union {
        struct {
          uint8_t osc1_2nd_matrix_input_matrix_divider_ratio_control: 3; // [84H(0), 1058:1056]
          uint8_t osc0_2nd_matrix_input_matrix_divider_ratio_control: 3; // [84H(3), 1061:1059]
        };
        uint8_t reg_84;
      };
      union {
        uint8_t reg_85;
      };
      union {
        uint8_t reg_86;
      };
      union {
        struct {
          uint8_t : 1;                  // [87H(0), 1080:1080]
          uint8_t : 1;                  // [87H(1), 1081:1081]
          uint8_t acmp0l_hysteresis: 2; // [87H(2), 1083:1082]
        };
        uint8_t reg_87;
      };
      union {
        struct {
          uint8_t acmp1l_hysteresis: 2;                                               // [88H(0), 1089:1088]
          uint8_t : 1;                                                                // [88H(2), 1090:1090]
          uint8_t : 1;                                                                // [88H(3), 1091:1091]
          uint8_t acmp1l_positive_input_come_from_acmp0ls_input_mux_output_enable: 1; // [88H(4), 1092:1092]
        };
        uint8_t reg_88;
      };
      union {
        uint8_t reg_89;
      };
      union {
        uint8_t reg_8a;
      };
      union {
        struct {
          uint8_t acmp0l_gain_divider: 2; // [8BH(0), 1113:1112]
          uint8_t acmp0l_vref: 6;         // [8BH(2), 1119:1114]
        };
        uint8_t reg_8b;
      };
      union {
        struct {
          uint8_t acmp1l_gain_divider: 2; // [8CH(0), 1121:1120]
          uint8_t acmp1l_vref: 6;         // [8CH(2), 1127:1122]
        };
        uint8_t reg_8c;
      };
      union {
        struct {
          uint8_t : 1;                      // [8DH(0), 1128:1128]
          uint8_t : 2;                      // [8DH(1), 1130:1129]
          uint8_t vref_output_op: 1;        // [8DH(3), 1131:1131]
          uint8_t vref0_input_selection: 2; // [8DH(4), 1133:1132]
        };
        uint8_t reg_8d;
      };
      union {
        struct {
          uint8_t : 1;            // [8EH(0), 1136:1136]
          uint8_t : 1;            // [8EH(1), 1137:1137]
          uint8_t : 1;            // [8EH(2), 1138:1138]
          uint8_t vref_out_pd: 1; // [8EH(3), 1139:1139]
        };
        uint8_t reg_8e;
      };
      union {
        uint8_t reg_8f;
      };
      union {
        struct {
          uint8_t lut2_0_dff0_setting: 4; // [90H(0), 1155:1152]
          uint8_t lut2_1_dff1_setting: 4; // [90H(4), 1159:1156]
        };
        uint8_t reg_90;
      };
      union {
        struct {
          uint8_t lut2_2_dff2_setting: 4;     // [91H(0), 1163:1160]
          uint8_t lut2_3_val_or_pgen_data: 4; // [91H(4), 1167:1164]
        };
        uint8_t reg_91;
      };
      union {
        struct {
          uint8_t pgen_data_7_0: 8; // [92H(0), 1175:1168]
        };
        uint8_t reg_92;
      };
      union {
        struct {
          uint8_t pgen_data_15_8: 8; // [93H(0), 1183:1176]
        };
        uint8_t reg_93;
      };
      union {
        struct {
          uint8_t lut3_0_dff3_setting: 8; // [94H(0), 1191:1184]
        };
        uint8_t reg_94;
      };
      union {
        struct {
          uint8_t lut3_1_dff4_setting: 8; // [95H(0), 1199:1192]
        };
        uint8_t reg_95;
      };
      union {
        struct {
          uint8_t lut3_2_dff5_setting: 8; // [96H(0), 1207:1200]
        };
        uint8_t reg_96;
      };
      union {
        struct {
          uint8_t lut3_3_dff6_setting: 8; // [97H(0), 1215:1208]
        };
        uint8_t reg_97;
      };
      union {
        struct {
          uint8_t lut3_4_dff7_setting: 8; // [98H(0), 1223:1216]
        };
        uint8_t reg_98;
      };
      union {
        struct {
          uint8_t lut3_5_dff8_setting: 8; // [99H(0), 1231:1224]
        };
        uint8_t reg_99;
      };
      union {
