alpelectronix/RP2040-ESP32C3-Development-Board/RP2040-ESP32C3_Dev_Board/SLG46826/I2C_SLG46826_REG.h
        struct {
          uint8_t lut2_0_or_dff0_select: 1; // [9AH(0), 1232:1232]
          uint8_t lut2_1_or_dff1_select: 1; // [9AH(1), 1233:1233]
          uint8_t lut2_2_or_dff2_select: 1; // [9AH(2), 1234:1234]
          uint8_t lut2_3_or_pgen_select: 1; // [9AH(3), 1235:1235]
          uint8_t lut3_0_or_dff3_select: 1; // [9AH(4), 1236:1236]
          uint8_t dff3_secondq_sel: 1;      // [9AH(5), 1237:1237]
          uint8_t lut3_1_or_dff4_select: 1; // [9AH(6), 1238:1238]
          uint8_t lut3_2_or_dff5_select: 1; // [9AH(7), 1239:1239]
        };
        uint8_t reg_9a;
      };
      union {
        struct {
          uint8_t lut3_3_or_dff6_select: 1;             // [9BH(0), 1240:1240]
          uint8_t lut3_4_or_dff7_select: 1;             // [9BH(1), 1241:1241]
          uint8_t lut3_5_or_dff8_select: 1;             // [9BH(2), 1242:1242]
          uint8_t filter_or_edge_detector_selection: 1; // [9BH(3), 1243:1243]
          uint8_t output_polarity_select: 1;            // [9BH(4), 1244:1244]
          uint8_t select_the_edge_mode: 2;              // [9BH(5), 1246:1245]
        };
        uint8_t reg_9b;
      };
      union {
        struct {
          uint8_t lut_value_or_pipe_delay_out_sel_or_nset_end_value: 8; // [9CH(0), 1255:1248]
        };
        uint8_t reg_9c;
      };
      union {
        struct {
          uint8_t pipe_delay_out1_polarity_select: 1;                           // [9DH(0), 1256:1256]
          uint8_t lut3_6_or_pipe_delay_select: 1;                               // [9DH(1), 1257:1257]
          uint8_t pipe_ripp_cnt_s: 1;                                           // [9DH(2), 1258:1258]
          uint8_t select_the_edge_mode_of_programmable_delay_edge_detector: 2;  // [9DH(3), 1260:1259]
          uint8_t delay_value_select_for_programmable_delay_edge_detector: 2;   // [9DH(5), 1262:1261]
        };
        uint8_t reg_9d;
      };
      union {
        uint8_t reg_9e;
      };
      union {
        uint8_t reg_9f;
      };
      union {
        struct {
          uint8_t : 1;                        // [A0H(0), 1280:1280]
          uint8_t : 1;                        // [A0H(1), 1281:1281]
          uint8_t : 1;                        // [A0H(2), 1282:1282]
          uint8_t : 1;                        // [A0H(3), 1283:1283]
          uint8_t : 1;                        // [A0H(4), 1284:1284]
          uint8_t : 1;                        // [A0H(5), 1285:1285]
          uint8_t : 1;                        // [A0H(6), 1286:1286]
          uint8_t fsm0_set_rst_selection: 1;  // [A0H(7), 1287:1287]
        };
        uint8_t reg_a0;
      };
      union {
        struct {
          uint8_t lut4_0_dff9_setting_7_0: 8; // [A1H(0), 1295:1288]
        };
        uint8_t reg_a1;
      };
      union {
        struct {
          uint8_t lut4_0_dff9_setting_15_8: 8; // [A2H(0), 1303:1296]
        };
        uint8_t reg_a2;
      };
      union {
        struct {
          uint8_t dly_cnt0_mode_selection: 2;       // [A3H(0), 1305:1304]
          uint8_t dly_cnt0_edge_mode_selection: 2;  // [A3H(2), 1307:1306]
          uint8_t dly_cnt0_clock_source_select: 4;  // [A3H(4), 1311:1308]
        };
        uint8_t reg_a3;
      };
      union {
        struct {
          uint8_t cnt0_output_pol_selection: 1;         // [A4H(0), 1312:1312]
          uint8_t cnt0_initial_value_selection: 2;      // [A4H(1), 1314:1313]
          uint8_t : 1;                                  // [A4H(3), 1315:1315]
          uint8_t : 1;                                  // [A4H(4), 1316:1316]
          uint8_t keep_signal_sync_selection: 1;        // [A4H(5), 1317:1317]
          uint8_t up_signal_sync_selection: 1;          // [A4H(6), 1318:1318]
          uint8_t cnt0_dly_edet_function_selection: 1;  // [A4H(7), 1319:1319]
        };
        uint8_t reg_a4;
      };
      union {
        struct {
          uint8_t reg_cnt0_data_7_0: 8; // [A5H(0), 1327:1320]
        };
        uint8_t reg_a5;
      };
      union {
        struct {
          uint8_t reg_cnt0_data_15_8: 8; // [A6H(0), 1335:1328]
        };
        uint8_t reg_a6;
      };
      union {
        struct {
          uint8_t cnt0_cnt_mode_sync_selection: 1;  // [A7H(0), 1336:1336]
          uint8_t : 1;                              // [A7H(1), 1337:1337]
          uint8_t : 1;                              // [A7H(2), 1338:1338]
          uint8_t : 1;                              // [A7H(3), 1339:1339]
          uint8_t : 1;                              // [A7H(4), 1340:1340]
          uint8_t : 1;                              // [A7H(5), 1341:1341]
          uint8_t cnt1_initial_value_selection: 2;  // [A7H(6), 1343:1342]
        };
        uint8_t reg_a7;
      };
      union {
        struct {
          uint8_t lut3_7_dff10_setting: 8; // [A8H(0), 1351:1344]
        };
        uint8_t reg_a8;
      };
      union {
        struct {
          uint8_t dly_cnt1_clock_source_select: 4;          // [A9H(0), 1355:1352]
          uint8_t cnt1_function_and_edge_mode_selection: 4; // [A9H(4), 1359:1356]
        };
        uint8_t reg_a9;
      };
      union {
        struct {
          uint8_t reg_cnt1_data: 8; // [AAH(0), 1367:1360]
        };
        uint8_t reg_aa;
      };
      union {
        struct {
          uint8_t cnt1_output_pol_selection: 1;         // [ABH(0), 1368:1368]
          uint8_t : 1;                                  // [ABH(1), 1369:1369]
          uint8_t cnt1_cnt_mode_sync_selection: 1;      // [ABH(2), 1370:1370]
          uint8_t cnt1_dly_edet_function_selection: 1;  // [ABH(3), 1371:1371]
          uint8_t : 4;                                  // [ABH(4), 1375:1372]
        };
        uint8_t reg_ab;
      };
      union {
        struct {
          uint8_t lut3_8_dff_11_setting: 8; // [ACH(0), 1383:1376]
        };
        uint8_t reg_ac;
      };
      union {
        struct {
          uint8_t dly_cnt2_clock_source_select: 4;          // [ADH(0), 1387:1384]
          uint8_t cnt2_function_and_edge_mode_selection: 4; // [ADH(4), 1391:1388]
        };
        uint8_t reg_ad;
      };
      union {
        struct {
          uint8_t cnt2_initial_value_selection: 2;      // [AEH(0), 1393:1392]
          uint8_t : 1;                                  // [AEH(2), 1394:1394]
          uint8_t cnt2_output_pol_selection: 1;         // [AEH(3), 1395:1395]
          uint8_t : 1;                                  // [AEH(4), 1396:1396]
          uint8_t cnt2_cnt_mode_sync_selection: 1;      // [AEH(5), 1397:1397]
          uint8_t cnt2_dly_edet_function_selection: 1;  // [AEH(6), 1398:1398]
        };
        uint8_t reg_ae;
      };
      union {
        struct {
          uint8_t reg_cnt2_data: 8; // [AFH(0), 1407:1400]
        };
        uint8_t reg_af;
      };
      union {
        struct {
          uint8_t : 1;                              // [B0H(0), 1408:1408]
          uint8_t : 1;                              // [B0H(1), 1409:1409]
          uint8_t : 1;                              // [B0H(2), 1410:1410]
          uint8_t : 1;                              // [B0H(3), 1411:1411]
          uint8_t : 1;                              // [B0H(4), 1412:1412]
          uint8_t : 1;                              // [B0H(5), 1413:1413]
          uint8_t cnt3_initial_value_selection: 2;  // [B0H(6), 1415:1414]
        };
        uint8_t reg_b0;
      };
      union {
        struct {
          uint8_t lut3_9_dff12_setting: 8; // [B1H(0), 1423:1416]
        };
        uint8_t reg_b1;
      };
      union {
        struct {
          uint8_t dly_cnt3_clock_source_select: 4;          // [B2H(0), 1427:1424]
          uint8_t cnt3_function_and_edge_mode_selection: 4; // [B2H(4), 1431:1428]
        };
        uint8_t reg_b2;
      };
      union {
        struct {
          uint8_t reg_cnt3_data: 8; // [B3H(0), 1439:1432]
        };
        uint8_t reg_b3;
      };
      union {
        struct {
          uint8_t cnt3_output_pol_selection: 1;         // [B4H(0), 1440:1440]
          uint8_t : 1;                                  // [B4H(1), 1441:1441]
          uint8_t cnt3_cnt_mode_sync_selection: 1;      // [B4H(2), 1442:1442]
          uint8_t cnt3_dly_edet_function_selection: 1;  // [B4H(3), 1443:1443]
        };
        uint8_t reg_b4;
      };
      union {
        struct {
          uint8_t lut3_dff_setting: 8; // [B5H(0), 1455:1448]
        };
        uint8_t reg_b5;
      };
      union {
        struct {
          uint8_t dly_cnt4_clock_source_select: 4;          // [B6H(0), 1459:1456]
          uint8_t cnt4_function_and_edge_mode_selection: 4; // [B6H(4), 1463:1460]
        };
        uint8_t reg_b6;
      };
      union {
        struct {
          uint8_t cnt4_initial_value_selection: 2;      // [B7H(0), 1465:1464]
          uint8_t : 1;                                  // [B7H(2), 1466:1466]
          uint8_t cnt4_output_pol_selection: 1;         // [B7H(3), 1467:1467]
          uint8_t : 1;                                  // [B7H(4), 1468:1468]
          uint8_t cnt4_cnt_mode_sync_selection: 1;      // [B7H(5), 1469:1469]
          uint8_t cnt4_dly_edet_function_selection: 1;  // [B7H(6), 1470:1470]
        };
        uint8_t reg_b7;
      };
      union {
        struct {
          uint8_t reg_cnt4_data: 8; // [B8H(0), 1479:1472]
        };
        uint8_t reg_b8;
      };
      union {
        struct {
          uint8_t : 1;                              // [B9H(0), 1480:1480]
          uint8_t : 1;                              // [B9H(1), 1481:1481]
          uint8_t : 1;                              // [B9H(2), 1482:1482]
          uint8_t : 1;                              // [B9H(3), 1483:1483]
          uint8_t : 1;                              // [B9H(4), 1484:1484]
          uint8_t : 1;                              // [B9H(5), 1485:1485]
          uint8_t cnt5_initial_value_selection: 2;  // [B9H(6), 1487:1486]
        };
        uint8_t reg_b9;
      };
      union {
        struct {
          uint8_t lut3_11_dff14_setting: 8; // [BAH(0), 1495:1488]
        };
        uint8_t reg_ba;
      };
      union {
        struct {
          uint8_t dly_cnt5_clock_source_select: 4;          // [BBH(0), 1499:1496]
          uint8_t cnt5_function_and_edge_mode_selection: 4; // [BBH(4), 1503:1500]
        };
        uint8_t reg_bb;
      };
      union {
        struct {
          uint8_t reg_cnt5_data: 8; // [BCH(0), 1511:1504]
        };
        uint8_t reg_bc;
      };
      union {
        struct {
          uint8_t cnt5_output_pol_selection: 1;         // [BDH(0), 1512:1512]
          uint8_t : 1;                                  // [BDH(1), 1513:1513]
          uint8_t cnt5_cnt_mode_sync_selection: 1;      // [BDH(2), 1514:1514]
          uint8_t cnt5_dly_edet_function_selection: 1;  // [BDH(3), 1515:1515]
        };
        uint8_t reg_bd;
      };
      union {
        struct {
          uint8_t lut3_12_dff15_setting: 8; // [BEH(0), 1527:1520]
        };
        uint8_t reg_be;
      };
      union {
        struct {
          uint8_t dly_cnt6_clock_source_select: 4;          // [BFH(0), 1531:1528]
          uint8_t cnt6_function_and_edge_mode_selection: 4; // [BFH(4), 1535:1532]
        };
        uint8_t reg_bf;
      };
      union {
        struct {
          uint8_t cnt6_initial_value_selection: 2;      // [C0H(0), 1537:1536]
          uint8_t : 1;                                  // [C0H(2), 1538:1538]
          uint8_t cnt6_output_pol_selection: 1;         // [C0H(3), 1539:1539]
          uint8_t : 1;                                  // [C0H(4), 1540:1540]
          uint8_t cnt6_cnt_mode_sync_selection: 1;      // [C0H(5), 1541:1541]
          uint8_t cnt6_dly_edet_function_selection: 1;  // [C0H(6), 1542:1542]
        };
        uint8_t reg_c0;
      };
      union {
        struct {
          uint8_t reg_cnt6_data: 8; // [C1H(0), 1551:1544]
        };
        uint8_t reg_c1;
      };
      union {
        struct {
          uint8_t : 5;                              // [C2H(0), 1556:1552]
          uint8_t cnt7_output_pol_selection: 1;     // [C2H(5), 1557:1557]
          uint8_t : 1;                              // [C2H(6), 1558:1558]
          uint8_t cnt7_cnt_mode_sync_selection: 1;  // [C2H(7), 1559:1559]
        };
        uint8_t reg_c2;
      };
      union {
        struct {
          uint8_t lut3_13_dff16_setting: 8; // [C3H(0), 1567:1560]
        };
        uint8_t reg_c3;
      };
      union {
        struct {
          uint8_t dly_cnt7_clock_source_select: 4;          // [C4H(0), 1571:1568]
          uint8_t cnt7_function_and_edge_mode_selection: 4; // [C4H(4), 1575:1572]
        };
        uint8_t reg_c4;
      };
      union {
        struct {
          uint8_t cnt7_initial_value_selection: 2;      // [C5H(0), 1577:1576]
          uint8_t cnt7_dly_edet_function_selection: 1;  // [C5H(2), 1578:1578]
        };
        uint8_t reg_c5;
      };
      union {
        struct {
          uint8_t reg_cnt7_data: 8; // [C6H(0), 1591:1584]
        };
        uint8_t reg_c6;
      };
      union {
        struct {
          uint8_t io0_i2c_output_expander_data: 1;    // [C7H(0), 1592:1592]
          uint8_t io0_i2c_output_expander_select: 1;  // [C7H(1), 1593:1593]
          uint8_t io5_i2c_output_expander_data: 1;    // [C7H(2), 1594:1594]
          uint8_t io5_i2c_output_expander_select: 1;  // [C7H(3), 1595:1595]
          uint8_t io6_i2c_output_expander_data: 1;    // [C7H(4), 1596:1596]
          uint8_t io6_i2c_output_expander_select: 1;  // [C7H(5), 1597:1597]
          uint8_t io9_i2c_output_expander_data: 1;    // [C7H(6), 1598:1598]
          uint8_t io9_i2c_output_expander_select: 1;  // [C7H(7), 1599:1599]
        };
        uint8_t reg_c7;
      };
      union {
        struct {
          uint8_t : 1;                                                                // [C8H(0), 1600:1600]
          uint8_t i2c_reset_bit_with_reloading_nvm_into_data_register_soft_reset: 1;  // [C8H(1), 1601:1601]
          uint8_t io_latching_enable_during_i2c_write_interface: 1;                   // [C8H(2), 1602:1602]
        };
        uint8_t reg_c8;
      };
      union {
        struct {
          uint8_t i2c_write_mask_bits: 8; // [C9H(0), 1615:1608]
        };
        uint8_t reg_c9;
      };
      union {
        struct {
          uint8_t i2c_slave_address: 4;           // [CAH(0), 1619:1616]
          uint8_t slave_address_selection_a4: 1;  // [CAH(4), 1620:1620]
          uint8_t slave_address_selection_a5: 1;  // [CAH(5), 1621:1621]
          uint8_t slave_address_selection_a6: 1;  // [CAH(6), 1622:1622]
          uint8_t slave_address_selection_a7: 1;  // [CAH(7), 1623:1623]
        };
        uint8_t reg_ca;
      };
      union {
        struct {
          uint8_t pattern_id_byte_0: 8; // [CBH(0), 1631:1624]
        };
        uint8_t reg_cb;
      };
      union {
        uint8_t reg_cc;
      };
      union {
        uint8_t reg_cd;
      };
      union {
        uint8_t reg_ce;
      };
      union {
        uint8_t reg_cf;
      };
      union {
        uint8_t reg_d0;
      };
      union {
        uint8_t reg_d1;
      };
      union {
        uint8_t reg_d2;
      };
      union {
        uint8_t reg_d3;
      };
      union {
        uint8_t reg_d4;
      };
      union {
        uint8_t reg_d5;
      };
      union {
        uint8_t reg_d6;
      };
      union {
        uint8_t reg_d7;
      };
      union {
        uint8_t reg_d8;
      };
      union {
        uint8_t reg_d9;
      };
      union {
        uint8_t reg_da;
      };
      union {
        uint8_t reg_db;
      };
      union {
        uint8_t reg_dc;
      };
      union {
        uint8_t reg_dd;
      };
      union {
        uint8_t reg_de;
      };
      union {
        uint8_t reg_df;
      };
      union {
        struct {
          uint8_t register_read_selection_bits: 2;  // [E0H(0), 1793:1792]
          uint8_t register_write_selection_bits: 2; // [E0H(2), 1795:1794]
        };
        uint8_t reg_e0;
      };
      union {
        struct {
          uint8_t nvm_configuration_selection_bits: 2; // [E1H(0), 1801:1800]
        };
        uint8_t reg_e1;
      };
      union {
        uint8_t reg_e2;
      };
      union {
        struct {
          uint8_t : 2;                                // [E2H(0), 1809:1808]
          uint8_t write_protect_register_enable: 1;   // [E2H(2), 1810:1810]
          uint8_t : 5;                                // [E2H(3), 1815:1811]
          uint8_t page_selection_for_erase_erseb: 5;  // [E3H(0), 1820:1816]
          uint8_t : 1;                                // [E3H(5), 1821:1821]
          uint8_t : 1;                                // [E3H(6), 1822:1822]
          uint8_t erase_enable: 1;                    // [E3H(7), 1823:1823]
        };
        uint8_t reg_e3;
      };
      union {
        struct {
          uint8_t protection_lock_bit_prl: 1; // [E4H(0), 1824:1824]
        };
        uint8_t reg_e4;
      };
      union {
        uint8_t reg_e5;
      };
      union {
        uint8_t reg_e6;
      };
      union {
        uint8_t reg_e7;
      };
      union {
        uint8_t reg_e8;
      };
      union {
        uint8_t reg_e9;
      };
      union {
        uint8_t reg_ea;
      };
      union {
        uint8_t reg_eb;
      };
      union {
        uint8_t reg_ec;
      };
      union {
        uint8_t reg_ed;
      };
      union {
        uint8_t reg_ee;
      };
      union {
        uint8_t reg_ef;
      };
      union {
        uint8_t reg_f0;
      };
      union {
        uint8_t reg_f1;
      };
      union {
        uint8_t reg_f2;
      };
      union {
        uint8_t reg_f3;
      };
      union {
        uint8_t reg_f4;
      };
      union {
        uint8_t reg_f5;
      };
      union {
        uint8_t reg_f6;
      };
      union {
        uint8_t reg_f7;
      };
      union {
        uint8_t reg_f8;
      };
      union {
        uint8_t reg_f9;
      };
      union {
        uint8_t reg_fa;
      };
      union {
        uint8_t reg_fb;
      };
      union {
        uint8_t reg_fc;
      };
      union {
        uint8_t reg_fd;
      };
      union {
        uint8_t reg_fe;
      };
      union {
        uint8_t reg_ff;
      };

