alpelectronix/RP2040-ESP32C3-Development-Board/RP2040-ESP32C3_Dev_Board/SLG46826/I2C_SLG46826_REG.h
    };
    uint8_t reg_data[256];
  };
} slg_register_t;

inline void debug_print_slg46826(const slg_register_t &slgReg) {
  Serial.println();

  Serial.printf("%3d(0x%02X) : [60H(0) 768:768(1)] io_fast_pull_up_down_enable\n", slgReg.io_fast_pull_up_down_enable, slgReg.io_fast_pull_up_down_enable);
  Serial.printf("%3d(0x%02X) : [60H(1) 769:769(1)] i2c_mode_selection\n", slgReg.i2c_mode_selection, slgReg.i2c_mode_selection);
  Serial.printf("%3d(0x%02X) : [61H(0) 777:776(2)] io0_input_mode_configuration\n", slgReg.io0_input_mode_configuration, slgReg.io0_input_mode_configuration);
  Serial.printf("%3d(0x%02X) : [61H(2) 779:778(2)] io0_output_mode_configuration\n", slgReg.io0_output_mode_configuration, slgReg.io0_output_mode_configuration);
  Serial.printf("%3d(0x%02X) : [61H(4) 781:780(2)] io0_pull_up_down_resistance_selection\n", slgReg.io0_pull_up_down_resistance_selection, slgReg.io0_pull_up_down_resistance_selection);
  Serial.printf("%3d(0x%02X) : [61H(6) 782:782(1)] io0_pull_up_down_selection\n", slgReg.io0_pull_up_down_selection, slgReg.io0_pull_up_down_selection);
  Serial.printf("%3d(0x%02X) : [61H(7) 783:783(1)] io0_output_enable\n", slgReg.io0_output_enable, slgReg.io0_output_enable);
  Serial.printf("%3d(0x%02X) : [62H(0) 785:784(2)] io1_input_mode_configuration\n", slgReg.io1_input_mode_configuration, slgReg.io1_input_mode_configuration);
  Serial.printf("%3d(0x%02X) : [62H(2) 787:786(2)] io1_output_mode_configuration\n", slgReg.io1_output_mode_configuration, slgReg.io1_output_mode_configuration);
  Serial.printf("%3d(0x%02X) : [62H(4) 789:788(2)] io1_pull_up_down_resistance_selection\n", slgReg.io1_pull_up_down_resistance_selection, slgReg.io1_pull_up_down_resistance_selection);
  Serial.printf("%3d(0x%02X) : [62H(6) 790:790(1)] io1_pull_up_down_selection\n", slgReg.io1_pull_up_down_selection, slgReg.io1_pull_up_down_selection);
  Serial.printf("%3d(0x%02X) : [64H(0) 801:800(2)] io2_input_mode_configuration\n", slgReg.io2_input_mode_configuration, slgReg.io2_input_mode_configuration);
  Serial.printf("%3d(0x%02X) : [64H(2) 803:802(2)] io2_output_mode_configuration\n", slgReg.io2_output_mode_configuration, slgReg.io2_output_mode_configuration);
  Serial.printf("%3d(0x%02X) : [64H(4) 805:804(2)] io2_pull_up_down_resistance_selection\n", slgReg.io2_pull_up_down_resistance_selection, slgReg.io2_pull_up_down_resistance_selection);
  Serial.printf("%3d(0x%02X) : [64H(6) 806:806(1)] io2_pull_up_down_selection\n", slgReg.io2_pull_up_down_selection, slgReg.io2_pull_up_down_selection);
  Serial.printf("%3d(0x%02X) : [64H(7) 807:807(1)] io2_output_enable\n", slgReg.io2_output_enable, slgReg.io2_output_enable);
  Serial.printf("%3d(0x%02X) : [65H(0) 809:808(2)] io3_input_mode_configuration\n", slgReg.io3_input_mode_configuration, slgReg.io3_input_mode_configuration);
  Serial.printf("%3d(0x%02X) : [65H(2) 811:810(2)] io3_output_mode_configuration\n", slgReg.io3_output_mode_configuration, slgReg.io3_output_mode_configuration);
  Serial.printf("%3d(0x%02X) : [65H(4) 813:812(2)] io3_pull_up_down_resistance_selection\n", slgReg.io3_pull_up_down_resistance_selection, slgReg.io3_pull_up_down_resistance_selection);
  Serial.printf("%3d(0x%02X) : [65H(6) 814:814(1)] io3_pull_up_down_selection\n", slgReg.io3_pull_up_down_selection, slgReg.io3_pull_up_down_selection);
  Serial.printf("%3d(0x%02X) : [65H(7) 815:815(1)] io3_output_enable\n", slgReg.io3_output_enable, slgReg.io3_output_enable);
  Serial.printf("%3d(0x%02X) : [66H(0) 817:816(2)] io4_input_mode_configuration\n", slgReg.io4_input_mode_configuration, slgReg.io4_input_mode_configuration);
  Serial.printf("%3d(0x%02X) : [66H(2) 819:818(2)] io4_output_mode_configuration\n", slgReg.io4_output_mode_configuration, slgReg.io4_output_mode_configuration);
  Serial.printf("%3d(0x%02X) : [66H(4) 821:820(2)] io4_pull_up_down_resistance_selection\n", slgReg.io4_pull_up_down_resistance_selection, slgReg.io4_pull_up_down_resistance_selection);
  Serial.printf("%3d(0x%02X) : [66H(6) 822:822(1)] io4_pull_up_down_selection\n", slgReg.io4_pull_up_down_selection, slgReg.io4_pull_up_down_selection);
  Serial.printf("%3d(0x%02X) : [67H(0) 825:824(2)] io5_input_mode_configuration\n", slgReg.io5_input_mode_configuration, slgReg.io5_input_mode_configuration);
  Serial.printf("%3d(0x%02X) : [67H(2) 827:826(2)] io5_output_mode_configuration\n", slgReg.io5_output_mode_configuration, slgReg.io5_output_mode_configuration);
  Serial.printf("%3d(0x%02X) : [67H(4) 829:828(2)] io5_pull_up_down_resistance_selection\n", slgReg.io5_pull_up_down_resistance_selection, slgReg.io5_pull_up_down_resistance_selection);
  Serial.printf("%3d(0x%02X) : [67H(6) 830:830(1)] io5_pull_up_down_selection\n", slgReg.io5_pull_up_down_selection, slgReg.io5_pull_up_down_selection);
  Serial.printf("%3d(0x%02X) : [68H(1) 834:833(2)] scl_input_mode_configuration\n", slgReg.scl_input_mode_configuration, slgReg.scl_input_mode_configuration);
  Serial.printf("%3d(0x%02X) : [68H(3) 836:835(2)] scl_pull_up_down_resistance_selection\n", slgReg.scl_pull_up_down_resistance_selection, slgReg.scl_pull_up_down_resistance_selection);
  Serial.printf("%3d(0x%02X) : [69H(1) 842:841(2)] sda_input_mode_configuration\n", slgReg.sda_input_mode_configuration, slgReg.sda_input_mode_configuration);
  Serial.printf("%3d(0x%02X) : [69H(3) 844:843(2)] sda_pull_up_down_resistance_selection\n", slgReg.sda_pull_up_down_resistance_selection, slgReg.sda_pull_up_down_resistance_selection);
  Serial.printf("%3d(0x%02X) : [6AH(2) 851:850(2)] io6_output_mode_configuration\n", slgReg.io6_output_mode_configuration, slgReg.io6_output_mode_configuration);
  Serial.printf("%3d(0x%02X) : [6AH(4) 853:852(2)] io6_pull_up_down_resistance_selection\n", slgReg.io6_pull_up_down_resistance_selection, slgReg.io6_pull_up_down_resistance_selection);
  Serial.printf("%3d(0x%02X) : [6AH(6) 854:854(1)] io6_pull_up_down_selection\n", slgReg.io6_pull_up_down_selection, slgReg.io6_pull_up_down_selection);
  Serial.printf("%3d(0x%02X) : [6AH(7) 855:855(1)] io6_output_enable\n", slgReg.io6_output_enable, slgReg.io6_output_enable);
  Serial.printf("%3d(0x%02X) : [6BH(2) 859:858(2)] io7_output_mode_configuration\n", slgReg.io7_output_mode_configuration, slgReg.io7_output_mode_configuration);
  Serial.printf("%3d(0x%02X) : [6BH(4) 861:860(2)] io7_pull_up_down_resistance_selection\n", slgReg.io7_pull_up_down_resistance_selection, slgReg.io7_pull_up_down_resistance_selection);
  Serial.printf("%3d(0x%02X) : [6BH(6) 862:862(1)] io7_pull_up_down_selection\n", slgReg.io7_pull_up_down_selection, slgReg.io7_pull_up_down_selection);
  Serial.printf("%3d(0x%02X) : [6BH(7) 863:863(1)] io7_output_enable\n", slgReg.io7_output_enable, slgReg.io7_output_enable);
  Serial.printf("%3d(0x%02X) : [6CH(0) 865:864(2)] io8_input_mode_configuration\n", slgReg.io8_input_mode_configuration, slgReg.io8_input_mode_configuration);
  Serial.printf("%3d(0x%02X) : [6CH(2) 867:866(2)] io8_output_mode_configuration\n", slgReg.io8_output_mode_configuration, slgReg.io8_output_mode_configuration);
  Serial.printf("%3d(0x%02X) : [6CH(4) 869:868(2)] io8_pull_up_down_resistance_selection\n", slgReg.io8_pull_up_down_resistance_selection, slgReg.io8_pull_up_down_resistance_selection);
  Serial.printf("%3d(0x%02X) : [6CH(6) 870:870(1)] io8_pull_up_down_selection\n", slgReg.io8_pull_up_down_selection, slgReg.io8_pull_up_down_selection);
  Serial.printf("%3d(0x%02X) : [6EH(0) 881:880(2)] io9_input_mode_configuration\n", slgReg.io9_input_mode_configuration, slgReg.io9_input_mode_configuration);
  Serial.printf("%3d(0x%02X) : [6EH(2) 883:882(2)] io9_output_mode_configuration\n", slgReg.io9_output_mode_configuration, slgReg.io9_output_mode_configuration);
  Serial.printf("%3d(0x%02X) : [6EH(4) 885:884(2)] io9_pull_up_down_resistance_selection\n", slgReg.io9_pull_up_down_resistance_selection, slgReg.io9_pull_up_down_resistance_selection);
  Serial.printf("%3d(0x%02X) : [6EH(6) 886:886(1)] io9_pull_up_down_selection\n", slgReg.io9_pull_up_down_selection, slgReg.io9_pull_up_down_selection);
  Serial.printf("%3d(0x%02X) : [6FH(0) 889:888(2)] io10_input_mode_configuration\n", slgReg.io10_input_mode_configuration, slgReg.io10_input_mode_configuration);
  Serial.printf("%3d(0x%02X) : [6FH(2) 891:890(2)] io10_output_mode_configuration\n", slgReg.io10_output_mode_configuration, slgReg.io10_output_mode_configuration);
  Serial.printf("%3d(0x%02X) : [6FH(4) 893:892(2)] io10_pull_up_down_resistance_selection\n", slgReg.io10_pull_up_down_resistance_selection, slgReg.io10_pull_up_down_resistance_selection);
  Serial.printf("%3d(0x%02X) : [6FH(6) 894:894(1)] io10_pull_up_down_selection\n", slgReg.io10_pull_up_down_selection, slgReg.io10_pull_up_down_selection);
  Serial.printf("%3d(0x%02X) : [70H(0) 897:896(2)] io11_input_mode_configuration\n", slgReg.io11_input_mode_configuration, slgReg.io11_input_mode_configuration);
  Serial.printf("%3d(0x%02X) : [70H(2) 899:898(2)] io11_output_mode_configuration\n", slgReg.io11_output_mode_configuration, slgReg.io11_output_mode_configuration);
  Serial.printf("%3d(0x%02X) : [70H(4) 901:900(2)] io11_pull_up_down_resistance_selection\n", slgReg.io11_pull_up_down_resistance_selection, slgReg.io11_pull_up_down_resistance_selection);
  Serial.printf("%3d(0x%02X) : [70H(6) 902:902(1)] io11_pull_up_down_selection\n", slgReg.io11_pull_up_down_selection, slgReg.io11_pull_up_down_selection);
  Serial.printf("%3d(0x%02X) : [71H(0) 905:904(2)] io12_input_mode_configuration\n", slgReg.io12_input_mode_configuration, slgReg.io12_input_mode_configuration);
  Serial.printf("%3d(0x%02X) : [71H(2) 907:906(2)] io12_output_mode_configuration\n", slgReg.io12_output_mode_configuration, slgReg.io12_output_mode_configuration);
  Serial.printf("%3d(0x%02X) : [71H(4) 909:908(2)] io12_pull_up_down_resistance_selection\n", slgReg.io12_pull_up_down_resistance_selection, slgReg.io12_pull_up_down_resistance_selection);
  Serial.printf("%3d(0x%02X) : [71H(6) 910:910(1)] io12_pull_up_down_selection\n", slgReg.io12_pull_up_down_selection, slgReg.io12_pull_up_down_selection);
  Serial.printf("%3d(0x%02X) : [72H(0) 913:912(2)] io13_input_mode_configuration\n", slgReg.io13_input_mode_configuration, slgReg.io13_input_mode_configuration);
  Serial.printf("%3d(0x%02X) : [72H(2) 915:914(2)] io13_output_mode_configuration\n", slgReg.io13_output_mode_configuration, slgReg.io13_output_mode_configuration);
  Serial.printf("%3d(0x%02X) : [72H(4) 917:916(2)] io13_pull_up_down_resistance_selection\n", slgReg.io13_pull_up_down_resistance_selection, slgReg.io13_pull_up_down_resistance_selection);
  Serial.printf("%3d(0x%02X) : [72H(6) 918:918(1)] io13_pull_up_down_selection\n", slgReg.io13_pull_up_down_selection, slgReg.io13_pull_up_down_selection);
  Serial.printf("%3d(0x%02X) : [73H(0) 921:920(2)] io14_input_mode_configuration\n", slgReg.io14_input_mode_configuration, slgReg.io14_input_mode_configuration);
  Serial.printf("%3d(0x%02X) : [73H(2) 923:922(2)] io14_output_mode_configuration\n", slgReg.io14_output_mode_configuration, slgReg.io14_output_mode_configuration);
  Serial.printf("%3d(0x%02X) : [73H(4) 925:924(2)] io14_pull_up_down_resistance_selection\n", slgReg.io14_pull_up_down_resistance_selection, slgReg.io14_pull_up_down_resistance_selection);
  Serial.printf("%3d(0x%02X) : [73H(6) 926:926(1)] io14_pull_up_down_selection\n", slgReg.io14_pull_up_down_selection, slgReg.io14_pull_up_down_selection);
  Serial.printf("%3d(0x%02X) : [74H(1) 929:929(1)] io0_digital_input\n", slgReg.io0_digital_input, slgReg.io0_digital_input);
  Serial.printf("%3d(0x%02X) : [74H(2) 930:930(1)] io1_digital_input\n", slgReg.io1_digital_input, slgReg.io1_digital_input);
  Serial.printf("%3d(0x%02X) : [74H(3) 931:931(1)] io2_digital_input\n", slgReg.io2_digital_input, slgReg.io2_digital_input);
  Serial.printf("%3d(0x%02X) : [74H(4) 932:932(1)] io3_digital_input\n", slgReg.io3_digital_input, slgReg.io3_digital_input);
  Serial.printf("%3d(0x%02X) : [74H(5) 933:933(1)] io4_digital_input\n", slgReg.io4_digital_input, slgReg.io4_digital_input);
  Serial.printf("%3d(0x%02X) : [74H(6) 934:934(1)] io5_digital_input\n", slgReg.io5_digital_input, slgReg.io5_digital_input);
  Serial.printf("%3d(0x%02X) : [74H(7) 935:935(1)] io8_digital_input\n", slgReg.io8_digital_input, slgReg.io8_digital_input);
  Serial.printf("%3d(0x%02X) : [75H(0) 936:936(1)] io9_digital_input\n", slgReg.io9_digital_input, slgReg.io9_digital_input);
  Serial.printf("%3d(0x%02X) : [75H(1) 937:937(1)] io10_digital_input\n", slgReg.io10_digital_input, slgReg.io10_digital_input);
  Serial.printf("%3d(0x%02X) : [75H(2) 938:938(1)] io11_digital_input\n", slgReg.io11_digital_input, slgReg.io11_digital_input);
  Serial.printf("%3d(0x%02X) : [75H(3) 939:939(1)] io12_digital_input\n", slgReg.io12_digital_input, slgReg.io12_digital_input);
  Serial.printf("%3d(0x%02X) : [75H(4) 940:940(1)] io13_digital_input\n", slgReg.io13_digital_input, slgReg.io13_digital_input);
  Serial.printf("%3d(0x%02X) : [75H(5) 941:941(1)] io14_digital_input\n", slgReg.io14_digital_input, slgReg.io14_digital_input);
  Serial.printf("%3d(0x%02X) : [75H(6) 942:942(1)] lut2_0_dff0_out\n", slgReg.lut2_0_dff0_out, slgReg.lut2_0_dff0_out);
  Serial.printf("%3d(0x%02X) : [75H(7) 943:943(1)] lut2_1_dff1_out\n", slgReg.lut2_1_dff1_out, slgReg.lut2_1_dff1_out);
  Serial.printf("%3d(0x%02X) : [76H(0) 944:944(1)] lut2_2_dff2_out\n", slgReg.lut2_2_dff2_out, slgReg.lut2_2_dff2_out);
  Serial.printf("%3d(0x%02X) : [76H(1) 945:945(1)] lut2_3_pgen_out\n", slgReg.lut2_3_pgen_out, slgReg.lut2_3_pgen_out);
  Serial.printf("%3d(0x%02X) : [76H(2) 946:946(1)] lut3_0_dff3_out\n", slgReg.lut3_0_dff3_out, slgReg.lut3_0_dff3_out);
  Serial.printf("%3d(0x%02X) : [76H(3) 947:947(1)] lut3_1_dff4_out\n", slgReg.lut3_1_dff4_out, slgReg.lut3_1_dff4_out);
  Serial.printf("%3d(0x%02X) : [76H(4) 948:948(1)] lut3_2_dff5_out\n", slgReg.lut3_2_dff5_out, slgReg.lut3_2_dff5_out);
  Serial.printf("%3d(0x%02X) : [76H(5) 949:949(1)] lut3_3_dff6_out\n", slgReg.lut3_3_dff6_out, slgReg.lut3_3_dff6_out);
  Serial.printf("%3d(0x%02X) : [76H(6) 950:950(1)] lut3_4_dff7_out\n", slgReg.lut3_4_dff7_out, slgReg.lut3_4_dff7_out);
  Serial.printf("%3d(0x%02X) : [76H(7) 951:951(1)] lut3_5_dff8_out\n", slgReg.lut3_5_dff8_out, slgReg.lut3_5_dff8_out);
  Serial.printf("%3d(0x%02X) : [77H(0) 952:952(1)] lut3_6_pipedly_ripp_cnt_out0\n", slgReg.lut3_6_pipedly_ripp_cnt_out0, slgReg.lut3_6_pipedly_ripp_cnt_out0);
  Serial.printf("%3d(0x%02X) : [77H(1) 953:953(1)] pipedly_ripp_cnt_out1\n", slgReg.pipedly_ripp_cnt_out1, slgReg.pipedly_ripp_cnt_out1);
  Serial.printf("%3d(0x%02X) : [77H(2) 954:954(1)] ripp_cnt_out2\n", slgReg.ripp_cnt_out2, slgReg.ripp_cnt_out2);
  Serial.printf("%3d(0x%02X) : [77H(3) 955:955(1)] edet_filter_out\n", slgReg.edet_filter_out, slgReg.edet_filter_out);
  Serial.printf("%3d(0x%02X) : [77H(4) 956:956(1)] prog_dly_edet_out\n", slgReg.prog_dly_edet_out, slgReg.prog_dly_edet_out);
  Serial.printf("%3d(0x%02X) : [77H(5) 957:957(1)] multfunc_8bit_1_dly_cnt_out\n", slgReg.multfunc_8bit_1_dly_cnt_out, slgReg.multfunc_8bit_1_dly_cnt_out);
  Serial.printf("%3d(0x%02X) : [77H(6) 958:958(1)] ckosc1_matrix_osc1_matrix_input\n", slgReg.ckosc1_matrix_osc1_matrix_input, slgReg.ckosc1_matrix_osc1_matrix_input);
  Serial.printf("%3d(0x%02X) : [77H(7) 959:959(1)] ckosc0_matrix_osc0_matrix_input\n", slgReg.ckosc0_matrix_osc0_matrix_input, slgReg.ckosc0_matrix_osc0_matrix_input);
  Serial.printf("%3d(0x%02X) : [78H(0) 960:960(1)] ckosc2_matrix_osc2_matrix_input\n", slgReg.ckosc2_matrix_osc2_matrix_input, slgReg.ckosc2_matrix_osc2_matrix_input);
  Serial.printf("%3d(0x%02X) : [78H(1) 961:961(1)] multfunc_8bit_2_dly_cnt_out\n", slgReg.multfunc_8bit_2_dly_cnt_out, slgReg.multfunc_8bit_2_dly_cnt_out);
  Serial.printf("%3d(0x%02X) : [78H(2) 962:962(1)] multfunc_8bit_3_dly_cnt_out\n", slgReg.multfunc_8bit_3_dly_cnt_out, slgReg.multfunc_8bit_3_dly_cnt_out);
  Serial.printf("%3d(0x%02X) : [78H(3) 963:963(1)] multfunc_8bit_4_dly_cnt_out\n", slgReg.multfunc_8bit_4_dly_cnt_out, slgReg.multfunc_8bit_4_dly_cnt_out);
  Serial.printf("%3d(0x%02X) : [78H(4) 964:964(1)] multfunc_8bit_5_dly_cnt_out\n", slgReg.multfunc_8bit_5_dly_cnt_out, slgReg.multfunc_8bit_5_dly_cnt_out);
  Serial.printf("%3d(0x%02X) : [78H(5) 965:965(1)] multfunc_8bit_6_dly_cnt_out\n", slgReg.multfunc_8bit_6_dly_cnt_out, slgReg.multfunc_8bit_6_dly_cnt_out);
  Serial.printf("%3d(0x%02X) : [78H(6) 966:966(1)] multfunc_8bit_7_dly_cnt_out\n", slgReg.multfunc_8bit_7_dly_cnt_out, slgReg.multfunc_8bit_7_dly_cnt_out);
  Serial.printf("%3d(0x%02X) : [78H(7) 967:967(1)] multfunc_16bit_0_lut_dff_out\n", slgReg.multfunc_16bit_0_lut_dff_out, slgReg.multfunc_16bit_0_lut_dff_out);
  Serial.printf("%3d(0x%02X) : [79H(0) 968:968(1)] multfunc_8bit_1_lut_dff_out\n", slgReg.multfunc_8bit_1_lut_dff_out, slgReg.multfunc_8bit_1_lut_dff_out);
  Serial.printf("%3d(0x%02X) : [79H(1) 969:969(1)] multfunc_8bit_2_lut_dff_out\n", slgReg.multfunc_8bit_2_lut_dff_out, slgReg.multfunc_8bit_2_lut_dff_out);
  Serial.printf("%3d(0x%02X) : [79H(2) 970:970(1)] multfunc_8bit_3_lut_dff_out\n", slgReg.multfunc_8bit_3_lut_dff_out, slgReg.multfunc_8bit_3_lut_dff_out);
  Serial.printf("%3d(0x%02X) : [79H(3) 971:971(1)] multfunc_8bit_4_lut_dff_out\n", slgReg.multfunc_8bit_4_lut_dff_out, slgReg.multfunc_8bit_4_lut_dff_out);
  Serial.printf("%3d(0x%02X) : [79H(4) 972:972(1)] multfunc_8bit_5_lut_dff_out\n", slgReg.multfunc_8bit_5_lut_dff_out, slgReg.multfunc_8bit_5_lut_dff_out);
  Serial.printf("%3d(0x%02X) : [79H(5) 973:973(1)] multfunc_8bit_6_lut_dff_out\n", slgReg.multfunc_8bit_6_lut_dff_out, slgReg.multfunc_8bit_6_lut_dff_out);
  Serial.printf("%3d(0x%02X) : [79H(6) 974:974(1)] multfunc_8bit_7_lut_dff_out\n", slgReg.multfunc_8bit_7_lut_dff_out, slgReg.multfunc_8bit_7_lut_dff_out);
  Serial.printf("%3d(0x%02X) : [79H(7) 975:975(1)] multfunc_16bit_0_dly_cnt_out\n", slgReg.multfunc_16bit_0_dly_cnt_out, slgReg.multfunc_16bit_0_dly_cnt_out);
  Serial.printf("%3d(0x%02X) : [7AH(0) 976:976(1)] virtual_input_7\n", slgReg.virtual_input_7, slgReg.virtual_input_7);
  Serial.printf("%3d(0x%02X) : [7AH(1) 977:977(1)] virtual_input_6\n", slgReg.virtual_input_6, slgReg.virtual_input_6);
  Serial.printf("%3d(0x%02X) : [7AH(2) 978:978(1)] virtual_input_5\n", slgReg.virtual_input_5, slgReg.virtual_input_5);
  Serial.printf("%3d(0x%02X) : [7AH(3) 979:979(1)] virtual_input_4\n", slgReg.virtual_input_4, slgReg.virtual_input_4);
  Serial.printf("%3d(0x%02X) : [7AH(4) 980:980(1)] virtual_input_3\n", slgReg.virtual_input_3, slgReg.virtual_input_3);
  Serial.printf("%3d(0x%02X) : [7AH(5) 981:981(1)] virtual_input_2\n", slgReg.virtual_input_2, slgReg.virtual_input_2);
  Serial.printf("%3d(0x%02X) : [7AH(6) 982:982(1)] virtual_input_1\n", slgReg.virtual_input_1, slgReg.virtual_input_1);
  Serial.printf("%3d(0x%02X) : [7AH(7) 983:983(1)] virtual_input_0\n", slgReg.virtual_input_0, slgReg.virtual_input_0);
  Serial.printf("%3d(0x%02X) : [7BH(2) 986:986(1)] acmp0l_out\n", slgReg.acmp0l_out, slgReg.acmp0l_out);
  Serial.printf("%3d(0x%02X) : [7BH(3) 987:987(1)] acmp1l_out\n", slgReg.acmp1l_out, slgReg.acmp1l_out);
  Serial.printf("%3d(0x%02X) : [7BH(4) 988:988(1)] second_ckosc1_matrix\n", slgReg.second_ckosc1_matrix, slgReg.second_ckosc1_matrix);
  Serial.printf("%3d(0x%02X) : [7BH(5) 989:989(1)] second_ckosc0_matrix\n", slgReg.second_ckosc0_matrix, slgReg.second_ckosc0_matrix);
  Serial.printf("%3d(0x%02X) : [7BH(6) 990:990(1)] por_core\n", slgReg.por_core, slgReg.por_core);
  Serial.printf("%3d(0x%02X) : [7CH(0) 999:992(8)] cnt0_counted_value_7_0\n", slgReg.cnt0_counted_value_7_0, slgReg.cnt0_counted_value_7_0);
  Serial.printf("%3d(0x%02X) : [7DH(0) 1007:1000(8)] cnt0_counted_value_15_8\n", slgReg.cnt0_counted_value_15_8, slgReg.cnt0_counted_value_15_8);
  Serial.printf("%3d(0x%02X) : [7EH(0) 1015:1008(8)] cnt2_counted_value\n", slgReg.cnt2_counted_value, slgReg.cnt2_counted_value);
  Serial.printf("%3d(0x%02X) : [7FH(0) 1023:1016(8)] cnt4_counted_value\n", slgReg.cnt4_counted_value, slgReg.cnt4_counted_value);
  Serial.printf("%3d(0x%02X) : [80H(0) 1024:1024(1)] osc1_turn_on_by_register\n", slgReg.osc1_turn_on_by_register, slgReg.osc1_turn_on_by_register);
  Serial.printf("%3d(0x%02X) : [80H(1) 1025:1025(1)] osc1_matrix_power_down_or_on_select\n", slgReg.osc1_matrix_power_down_or_on_select, slgReg.osc1_matrix_power_down_or_on_select);
  Serial.printf("%3d(0x%02X) : [80H(2) 1026:1026(1)] osc1_external_clock_source_enable\n", slgReg.osc1_external_clock_source_enable, slgReg.osc1_external_clock_source_enable);
  Serial.printf("%3d(0x%02X) : [80H(3) 1028:1027(2)] osc1_post_divider_ration_control\n", slgReg.osc1_post_divider_ration_control, slgReg.osc1_post_divider_ration_control);
  Serial.printf("%3d(0x%02X) : [80H(5) 1031:1029(3)] osc1_matrix_divider_ratio_control\n", slgReg.osc1_matrix_divider_ratio_control, slgReg.osc1_matrix_divider_ratio_control);
  Serial.printf("%3d(0x%02X) : [81H(0) 1032:1032(1)] osc2_turn_on_by_register\n", slgReg.osc2_turn_on_by_register, slgReg.osc2_turn_on_by_register);
  Serial.printf("%3d(0x%02X) : [81H(1) 1033:1033(1)] osc2_matrix_power_down_or_on_select\n", slgReg.osc2_matrix_power_down_or_on_select, slgReg.osc2_matrix_power_down_or_on_select);
  Serial.printf("%3d(0x%02X) : [81H(2) 1034:1034(1)] osc2_external_clock_source_enable\n", slgReg.osc2_external_clock_source_enable, slgReg.osc2_external_clock_source_enable);
  Serial.printf("%3d(0x%02X) : [81H(3) 1036:1035(2)] osc2_post_divider_ration_control\n", slgReg.osc2_post_divider_ration_control, slgReg.osc2_post_divider_ration_control);
  Serial.printf("%3d(0x%02X) : [81H(5) 1039:1037(3)] osc2_matrix_divider_ratio_control\n", slgReg.osc2_matrix_divider_ratio_control, slgReg.osc2_matrix_divider_ratio_control);
  Serial.printf("%3d(0x%02X) : [82H(0) 1040:1040(1)] osc0_turn_on_by_register\n", slgReg.osc0_turn_on_by_register, slgReg.osc0_turn_on_by_register);
  Serial.printf("%3d(0x%02X) : [82H(1) 1041:1041(1)] osc0_matrix_power_down_or_on_select\n", slgReg.osc0_matrix_power_down_or_on_select, slgReg.osc0_matrix_power_down_or_on_select);
  Serial.printf("%3d(0x%02X) : [82H(2) 1042:1042(1)] osc0_external_clock_source_enable\n", slgReg.osc0_external_clock_source_enable, slgReg.osc0_external_clock_source_enable);
  Serial.printf("%3d(0x%02X) : [82H(3) 1044:1043(2)] osc0_post_divider_ration_control\n", slgReg.osc0_post_divider_ration_control, slgReg.osc0_post_divider_ration_control);
  Serial.printf("%3d(0x%02X) : [82H(5) 1047:1045(3)] osc0_matrix_divider_ratio_control\n", slgReg.osc0_matrix_divider_ratio_control, slgReg.osc0_matrix_divider_ratio_control);
  Serial.printf("%3d(0x%02X) : [83H(1) 1049:1049(1)] osc0_matrix_out_enable\n", slgReg.osc0_matrix_out_enable, slgReg.osc0_matrix_out_enable);
  Serial.printf("%3d(0x%02X) : [83H(2) 1050:1050(1)] osc1_matrix_out_enable\n", slgReg.osc1_matrix_out_enable, slgReg.osc1_matrix_out_enable);
  Serial.printf("%3d(0x%02X) : [83H(3) 1051:1051(1)] osc2_matrix_out_enable\n", slgReg.osc2_matrix_out_enable, slgReg.osc2_matrix_out_enable);
  Serial.printf("%3d(0x%02X) : [83H(4) 1052:1052(1)] osc2_100_ns_startup_delay\n", slgReg.osc2_100_ns_startup_delay, slgReg.osc2_100_ns_startup_delay);
  Serial.printf("%3d(0x%02X) : [83H(5) 1053:1053(1)] osc0_2nd_matrix_out_enable\n", slgReg.osc0_2nd_matrix_out_enable, slgReg.osc0_2nd_matrix_out_enable);
  Serial.printf("%3d(0x%02X) : [83H(6) 1054:1054(1)] osc1_2nd_matrix_out_enable\n", slgReg.osc1_2nd_matrix_out_enable, slgReg.osc1_2nd_matrix_out_enable);
  Serial.printf("%3d(0x%02X) : [84H(0) 1058:1056(3)] osc1_2nd_matrix_input_matrix_divider_ratio_control\n", slgReg.osc1_2nd_matrix_input_matrix_divider_ratio_control, slgReg.osc1_2nd_matrix_input_matrix_divider_ratio_control);
