alpelectronix/RP2040-ESP32C3-Development-Board/RP2040-ESP32C3_Dev_Board/SLG46826/I2C_SLG46826_REG.h
  Serial.printf("%3d(0x%02X) : [84H(3) 1061:1059(3)] osc0_2nd_matrix_input_matrix_divider_ratio_control\n", slgReg.osc0_2nd_matrix_input_matrix_divider_ratio_control, slgReg.osc0_2nd_matrix_input_matrix_divider_ratio_control);
  Serial.printf("%3d(0x%02X) : [87H(2) 1083:1082(2)] acmp0l_hysteresis\n", slgReg.acmp0l_hysteresis, slgReg.acmp0l_hysteresis);
  Serial.printf("%3d(0x%02X) : [88H(0) 1089:1088(2)] acmp1l_hysteresis\n", slgReg.acmp1l_hysteresis, slgReg.acmp1l_hysteresis);
  Serial.printf("%3d(0x%02X) : [88H(4) 1092:1092(1)] acmp1l_positive_input_come_from_acmp0ls_input_mux_output_enable\n", slgReg.acmp1l_positive_input_come_from_acmp0ls_input_mux_output_enable, slgReg.acmp1l_positive_input_come_from_acmp0ls_input_mux_output_enable);
  Serial.printf("%3d(0x%02X) : [8BH(0) 1113:1112(2)] acmp0l_gain_divider\n", slgReg.acmp0l_gain_divider, slgReg.acmp0l_gain_divider);
  Serial.printf("%3d(0x%02X) : [8BH(2) 1119:1114(6)] acmp0l_vref\n", slgReg.acmp0l_vref, slgReg.acmp0l_vref);
  Serial.printf("%3d(0x%02X) : [8CH(0) 1121:1120(2)] acmp1l_gain_divider\n", slgReg.acmp1l_gain_divider, slgReg.acmp1l_gain_divider);
  Serial.printf("%3d(0x%02X) : [8CH(2) 1127:1122(6)] acmp1l_vref\n", slgReg.acmp1l_vref, slgReg.acmp1l_vref);
  Serial.printf("%3d(0x%02X) : [8DH(3) 1131:1131(1)] vref_output_op\n", slgReg.vref_output_op, slgReg.vref_output_op);
  Serial.printf("%3d(0x%02X) : [8DH(4) 1133:1132(2)] vref0_input_selection\n", slgReg.vref0_input_selection, slgReg.vref0_input_selection);
  Serial.printf("%3d(0x%02X) : [8EH(3) 1139:1139(1)] vref_out_pd\n", slgReg.vref_out_pd, slgReg.vref_out_pd);
  Serial.printf("%3d(0x%02X) : [90H(0) 1155:1152(4)] lut2_0_dff0_setting\n", slgReg.lut2_0_dff0_setting, slgReg.lut2_0_dff0_setting);
  Serial.printf("%3d(0x%02X) : [90H(4) 1159:1156(4)] lut2_1_dff1_setting\n", slgReg.lut2_1_dff1_setting, slgReg.lut2_1_dff1_setting);
  Serial.printf("%3d(0x%02X) : [91H(0) 1163:1160(4)] lut2_2_dff2_setting\n", slgReg.lut2_2_dff2_setting, slgReg.lut2_2_dff2_setting);
  Serial.printf("%3d(0x%02X) : [91H(4) 1167:1164(4)] lut2_3_val_or_pgen_data\n", slgReg.lut2_3_val_or_pgen_data, slgReg.lut2_3_val_or_pgen_data);
  Serial.printf("%3d(0x%02X) : [92H(0) 1175:1168(8)] pgen_data_7_0\n", slgReg.pgen_data_7_0, slgReg.pgen_data_7_0);
  Serial.printf("%3d(0x%02X) : [93H(0) 1183:1176(8)] pgen_data_15_8\n", slgReg.pgen_data_15_8, slgReg.pgen_data_15_8);
  Serial.printf("%3d(0x%02X) : [94H(0) 1191:1184(8)] lut3_0_dff3_setting\n", slgReg.lut3_0_dff3_setting, slgReg.lut3_0_dff3_setting);
  Serial.printf("%3d(0x%02X) : [95H(0) 1199:1192(8)] lut3_1_dff4_setting\n", slgReg.lut3_1_dff4_setting, slgReg.lut3_1_dff4_setting);
  Serial.printf("%3d(0x%02X) : [96H(0) 1207:1200(8)] lut3_2_dff5_setting\n", slgReg.lut3_2_dff5_setting, slgReg.lut3_2_dff5_setting);
  Serial.printf("%3d(0x%02X) : [97H(0) 1215:1208(8)] lut3_3_dff6_setting\n", slgReg.lut3_3_dff6_setting, slgReg.lut3_3_dff6_setting);
  Serial.printf("%3d(0x%02X) : [98H(0) 1223:1216(8)] lut3_4_dff7_setting\n", slgReg.lut3_4_dff7_setting, slgReg.lut3_4_dff7_setting);
  Serial.printf("%3d(0x%02X) : [99H(0) 1231:1224(8)] lut3_5_dff8_setting\n", slgReg.lut3_5_dff8_setting, slgReg.lut3_5_dff8_setting);
  Serial.printf("%3d(0x%02X) : [9AH(0) 1232:1232(1)] lut2_0_or_dff0_select\n", slgReg.lut2_0_or_dff0_select, slgReg.lut2_0_or_dff0_select);
  Serial.printf("%3d(0x%02X) : [9AH(1) 1233:1233(1)] lut2_1_or_dff1_select\n", slgReg.lut2_1_or_dff1_select, slgReg.lut2_1_or_dff1_select);
  Serial.printf("%3d(0x%02X) : [9AH(2) 1234:1234(1)] lut2_2_or_dff2_select\n", slgReg.lut2_2_or_dff2_select, slgReg.lut2_2_or_dff2_select);
  Serial.printf("%3d(0x%02X) : [9AH(3) 1235:1235(1)] lut2_3_or_pgen_select\n", slgReg.lut2_3_or_pgen_select, slgReg.lut2_3_or_pgen_select);
  Serial.printf("%3d(0x%02X) : [9AH(4) 1236:1236(1)] lut3_0_or_dff3_select\n", slgReg.lut3_0_or_dff3_select, slgReg.lut3_0_or_dff3_select);
  Serial.printf("%3d(0x%02X) : [9AH(5) 1237:1237(1)] dff3_secondq_sel\n", slgReg.dff3_secondq_sel, slgReg.dff3_secondq_sel);
  Serial.printf("%3d(0x%02X) : [9AH(6) 1238:1238(1)] lut3_1_or_dff4_select\n", slgReg.lut3_1_or_dff4_select, slgReg.lut3_1_or_dff4_select);
  Serial.printf("%3d(0x%02X) : [9AH(7) 1239:1239(1)] lut3_2_or_dff5_select\n", slgReg.lut3_2_or_dff5_select, slgReg.lut3_2_or_dff5_select);
  Serial.printf("%3d(0x%02X) : [9BH(0) 1240:1240(1)] lut3_3_or_dff6_select\n", slgReg.lut3_3_or_dff6_select, slgReg.lut3_3_or_dff6_select);
  Serial.printf("%3d(0x%02X) : [9BH(1) 1241:1241(1)] lut3_4_or_dff7_select\n", slgReg.lut3_4_or_dff7_select, slgReg.lut3_4_or_dff7_select);
  Serial.printf("%3d(0x%02X) : [9BH(2) 1242:1242(1)] lut3_5_or_dff8_select\n", slgReg.lut3_5_or_dff8_select, slgReg.lut3_5_or_dff8_select);
  Serial.printf("%3d(0x%02X) : [9BH(3) 1243:1243(1)] filter_or_edge_detector_selection\n", slgReg.filter_or_edge_detector_selection, slgReg.filter_or_edge_detector_selection);
  Serial.printf("%3d(0x%02X) : [9BH(4) 1244:1244(1)] output_polarity_select\n", slgReg.output_polarity_select, slgReg.output_polarity_select);
  Serial.printf("%3d(0x%02X) : [9BH(5) 1246:1245(2)] select_the_edge_mode\n", slgReg.select_the_edge_mode, slgReg.select_the_edge_mode);
  Serial.printf("%3d(0x%02X) : [9CH(0) 1255:1248(8)] lut_value_or_pipe_delay_out_sel_or_nset_end_value\n", slgReg.lut_value_or_pipe_delay_out_sel_or_nset_end_value, slgReg.lut_value_or_pipe_delay_out_sel_or_nset_end_value);
  Serial.printf("%3d(0x%02X) : [9DH(0) 1256:1256(1)] pipe_delay_out1_polarity_select\n", slgReg.pipe_delay_out1_polarity_select, slgReg.pipe_delay_out1_polarity_select);
  Serial.printf("%3d(0x%02X) : [9DH(1) 1257:1257(1)] lut3_6_or_pipe_delay_select\n", slgReg.lut3_6_or_pipe_delay_select, slgReg.lut3_6_or_pipe_delay_select);
  Serial.printf("%3d(0x%02X) : [9DH(2) 1258:1258(1)] pipe_ripp_cnt_s\n", slgReg.pipe_ripp_cnt_s, slgReg.pipe_ripp_cnt_s);
  Serial.printf("%3d(0x%02X) : [9DH(3) 1260:1259(2)] select_the_edge_mode_of_programmable_delay_edge_detector\n", slgReg.select_the_edge_mode_of_programmable_delay_edge_detector, slgReg.select_the_edge_mode_of_programmable_delay_edge_detector);
  Serial.printf("%3d(0x%02X) : [9DH(5) 1262:1261(2)] delay_value_select_for_programmable_delay_edge_detector\n", slgReg.delay_value_select_for_programmable_delay_edge_detector, slgReg.delay_value_select_for_programmable_delay_edge_detector);
  Serial.printf("%3d(0x%02X) : [A0H(7) 1287:1287(1)] fsm0_set_rst_selection\n", slgReg.fsm0_set_rst_selection, slgReg.fsm0_set_rst_selection);
  Serial.printf("%3d(0x%02X) : [A1H(0) 1295:1288(8)] lut4_0_dff9_setting_7_0\n", slgReg.lut4_0_dff9_setting_7_0, slgReg.lut4_0_dff9_setting_7_0);
  Serial.printf("%3d(0x%02X) : [A2H(0) 1303:1296(8)] lut4_0_dff9_setting_15_8\n", slgReg.lut4_0_dff9_setting_15_8, slgReg.lut4_0_dff9_setting_15_8);
  Serial.printf("%3d(0x%02X) : [A3H(0) 1305:1304(2)] dly_cnt0_mode_selection\n", slgReg.dly_cnt0_mode_selection, slgReg.dly_cnt0_mode_selection);
  Serial.printf("%3d(0x%02X) : [A3H(2) 1307:1306(2)] dly_cnt0_edge_mode_selection\n", slgReg.dly_cnt0_edge_mode_selection, slgReg.dly_cnt0_edge_mode_selection);
  Serial.printf("%3d(0x%02X) : [A3H(4) 1311:1308(4)] dly_cnt0_clock_source_select\n", slgReg.dly_cnt0_clock_source_select, slgReg.dly_cnt0_clock_source_select);
  Serial.printf("%3d(0x%02X) : [A4H(0) 1312:1312(1)] cnt0_output_pol_selection\n", slgReg.cnt0_output_pol_selection, slgReg.cnt0_output_pol_selection);
  Serial.printf("%3d(0x%02X) : [A4H(1) 1314:1313(2)] cnt0_initial_value_selection\n", slgReg.cnt0_initial_value_selection, slgReg.cnt0_initial_value_selection);
  Serial.printf("%3d(0x%02X) : [A4H(5) 1317:1317(1)] keep_signal_sync_selection\n", slgReg.keep_signal_sync_selection, slgReg.keep_signal_sync_selection);
  Serial.printf("%3d(0x%02X) : [A4H(6) 1318:1318(1)] up_signal_sync_selection\n", slgReg.up_signal_sync_selection, slgReg.up_signal_sync_selection);
  Serial.printf("%3d(0x%02X) : [A4H(7) 1319:1319(1)] cnt0_dly_edet_function_selection\n", slgReg.cnt0_dly_edet_function_selection, slgReg.cnt0_dly_edet_function_selection);
  Serial.printf("%3d(0x%02X) : [A5H(0) 1327:1320(8)] reg_cnt0_data_7_0\n", slgReg.reg_cnt0_data_7_0, slgReg.reg_cnt0_data_7_0);
  Serial.printf("%3d(0x%02X) : [A6H(0) 1335:1328(8)] reg_cnt0_data_15_8\n", slgReg.reg_cnt0_data_15_8, slgReg.reg_cnt0_data_15_8);
  Serial.printf("%3d(0x%02X) : [A7H(0) 1336:1336(1)] cnt0_cnt_mode_sync_selection\n", slgReg.cnt0_cnt_mode_sync_selection, slgReg.cnt0_cnt_mode_sync_selection);
  Serial.printf("%3d(0x%02X) : [A7H(6) 1343:1342(2)] cnt1_initial_value_selection\n", slgReg.cnt1_initial_value_selection, slgReg.cnt1_initial_value_selection);
  Serial.printf("%3d(0x%02X) : [A8H(0) 1351:1344(8)] lut3_7_dff10_setting\n", slgReg.lut3_7_dff10_setting, slgReg.lut3_7_dff10_setting);
  Serial.printf("%3d(0x%02X) : [A9H(0) 1355:1352(4)] dly_cnt1_clock_source_select\n", slgReg.dly_cnt1_clock_source_select, slgReg.dly_cnt1_clock_source_select);
  Serial.printf("%3d(0x%02X) : [A9H(4) 1359:1356(4)] cnt1_function_and_edge_mode_selection\n", slgReg.cnt1_function_and_edge_mode_selection, slgReg.cnt1_function_and_edge_mode_selection);
  Serial.printf("%3d(0x%02X) : [AAH(0) 1367:1360(8)] reg_cnt1_data\n", slgReg.reg_cnt1_data, slgReg.reg_cnt1_data);
  Serial.printf("%3d(0x%02X) : [ABH(0) 1368:1368(1)] cnt1_output_pol_selection\n", slgReg.cnt1_output_pol_selection, slgReg.cnt1_output_pol_selection);
  Serial.printf("%3d(0x%02X) : [ABH(2) 1370:1370(1)] cnt1_cnt_mode_sync_selection\n", slgReg.cnt1_cnt_mode_sync_selection, slgReg.cnt1_cnt_mode_sync_selection);
  Serial.printf("%3d(0x%02X) : [ABH(3) 1371:1371(1)] cnt1_dly_edet_function_selection\n", slgReg.cnt1_dly_edet_function_selection, slgReg.cnt1_dly_edet_function_selection);
  Serial.printf("%3d(0x%02X) : [ACH(0) 1383:1376(8)] lut3_8_dff_11_setting\n", slgReg.lut3_8_dff_11_setting, slgReg.lut3_8_dff_11_setting);
  Serial.printf("%3d(0x%02X) : [ADH(0) 1387:1384(4)] dly_cnt2_clock_source_select\n", slgReg.dly_cnt2_clock_source_select, slgReg.dly_cnt2_clock_source_select);
  Serial.printf("%3d(0x%02X) : [ADH(4) 1391:1388(4)] cnt2_function_and_edge_mode_selection\n", slgReg.cnt2_function_and_edge_mode_selection, slgReg.cnt2_function_and_edge_mode_selection);
  Serial.printf("%3d(0x%02X) : [AEH(0) 1393:1392(2)] cnt2_initial_value_selection\n", slgReg.cnt2_initial_value_selection, slgReg.cnt2_initial_value_selection);
  Serial.printf("%3d(0x%02X) : [AEH(3) 1395:1395(1)] cnt2_output_pol_selection\n", slgReg.cnt2_output_pol_selection, slgReg.cnt2_output_pol_selection);
  Serial.printf("%3d(0x%02X) : [AEH(5) 1397:1397(1)] cnt2_cnt_mode_sync_selection\n", slgReg.cnt2_cnt_mode_sync_selection, slgReg.cnt2_cnt_mode_sync_selection);
  Serial.printf("%3d(0x%02X) : [AEH(6) 1398:1398(1)] cnt2_dly_edet_function_selection\n", slgReg.cnt2_dly_edet_function_selection, slgReg.cnt2_dly_edet_function_selection);
  Serial.printf("%3d(0x%02X) : [AFH(0) 1407:1400(8)] reg_cnt2_data\n", slgReg.reg_cnt2_data, slgReg.reg_cnt2_data);
  Serial.printf("%3d(0x%02X) : [B0H(6) 1415:1414(2)] cnt3_initial_value_selection\n", slgReg.cnt3_initial_value_selection, slgReg.cnt3_initial_value_selection);
  Serial.printf("%3d(0x%02X) : [B1H(0) 1423:1416(8)] lut3_9_dff12_setting\n", slgReg.lut3_9_dff12_setting, slgReg.lut3_9_dff12_setting);
  Serial.printf("%3d(0x%02X) : [B2H(0) 1427:1424(4)] dly_cnt3_clock_source_select\n", slgReg.dly_cnt3_clock_source_select, slgReg.dly_cnt3_clock_source_select);
  Serial.printf("%3d(0x%02X) : [B2H(4) 1431:1428(4)] cnt3_function_and_edge_mode_selection\n", slgReg.cnt3_function_and_edge_mode_selection, slgReg.cnt3_function_and_edge_mode_selection);
  Serial.printf("%3d(0x%02X) : [B3H(0) 1439:1432(8)] reg_cnt3_data\n", slgReg.reg_cnt3_data, slgReg.reg_cnt3_data);
  Serial.printf("%3d(0x%02X) : [B4H(0) 1440:1440(1)] cnt3_output_pol_selection\n", slgReg.cnt3_output_pol_selection, slgReg.cnt3_output_pol_selection);
  Serial.printf("%3d(0x%02X) : [B4H(2) 1442:1442(1)] cnt3_cnt_mode_sync_selection\n", slgReg.cnt3_cnt_mode_sync_selection, slgReg.cnt3_cnt_mode_sync_selection);
  Serial.printf("%3d(0x%02X) : [B4H(3) 1443:1443(1)] cnt3_dly_edet_function_selection\n", slgReg.cnt3_dly_edet_function_selection, slgReg.cnt3_dly_edet_function_selection);
  Serial.printf("%3d(0x%02X) : [B5H(0) 1455:1448(8)] lut3_dff_setting\n", slgReg.lut3_dff_setting, slgReg.lut3_dff_setting);
  Serial.printf("%3d(0x%02X) : [B6H(0) 1459:1456(4)] dly_cnt4_clock_source_select\n", slgReg.dly_cnt4_clock_source_select, slgReg.dly_cnt4_clock_source_select);
  Serial.printf("%3d(0x%02X) : [B6H(4) 1463:1460(4)] cnt4_function_and_edge_mode_selection\n", slgReg.cnt4_function_and_edge_mode_selection, slgReg.cnt4_function_and_edge_mode_selection);
  Serial.printf("%3d(0x%02X) : [B7H(0) 1465:1464(2)] cnt4_initial_value_selection\n", slgReg.cnt4_initial_value_selection, slgReg.cnt4_initial_value_selection);
  Serial.printf("%3d(0x%02X) : [B7H(3) 1467:1467(1)] cnt4_output_pol_selection\n", slgReg.cnt4_output_pol_selection, slgReg.cnt4_output_pol_selection);
  Serial.printf("%3d(0x%02X) : [B7H(5) 1469:1469(1)] cnt4_cnt_mode_sync_selection\n", slgReg.cnt4_cnt_mode_sync_selection, slgReg.cnt4_cnt_mode_sync_selection);
  Serial.printf("%3d(0x%02X) : [B7H(6) 1470:1470(1)] cnt4_dly_edet_function_selection\n", slgReg.cnt4_dly_edet_function_selection, slgReg.cnt4_dly_edet_function_selection);
  Serial.printf("%3d(0x%02X) : [B8H(0) 1479:1472(8)] reg_cnt4_data\n", slgReg.reg_cnt4_data, slgReg.reg_cnt4_data);
  Serial.printf("%3d(0x%02X) : [B9H(6) 1487:1486(2)] cnt5_initial_value_selection\n", slgReg.cnt5_initial_value_selection, slgReg.cnt5_initial_value_selection);
  Serial.printf("%3d(0x%02X) : [BAH(0) 1495:1488(8)] lut3_11_dff14_setting\n", slgReg.lut3_11_dff14_setting, slgReg.lut3_11_dff14_setting);
  Serial.printf("%3d(0x%02X) : [BBH(0) 1499:1496(4)] dly_cnt5_clock_source_select\n", slgReg.dly_cnt5_clock_source_select, slgReg.dly_cnt5_clock_source_select);
  Serial.printf("%3d(0x%02X) : [BBH(4) 1503:1500(4)] cnt5_function_and_edge_mode_selection\n", slgReg.cnt5_function_and_edge_mode_selection, slgReg.cnt5_function_and_edge_mode_selection);
  Serial.printf("%3d(0x%02X) : [BCH(0) 1511:1504(8)] reg_cnt5_data\n", slgReg.reg_cnt5_data, slgReg.reg_cnt5_data);
  Serial.printf("%3d(0x%02X) : [BDH(0) 1512:1512(1)] cnt5_output_pol_selection\n", slgReg.cnt5_output_pol_selection, slgReg.cnt5_output_pol_selection);
  Serial.printf("%3d(0x%02X) : [BDH(2) 1514:1514(1)] cnt5_cnt_mode_sync_selection\n", slgReg.cnt5_cnt_mode_sync_selection, slgReg.cnt5_cnt_mode_sync_selection);
  Serial.printf("%3d(0x%02X) : [BDH(3) 1515:1515(1)] cnt5_dly_edet_function_selection\n", slgReg.cnt5_dly_edet_function_selection, slgReg.cnt5_dly_edet_function_selection);
  Serial.printf("%3d(0x%02X) : [BEH(0) 1527:1520(8)] lut3_12_dff15_setting\n", slgReg.lut3_12_dff15_setting, slgReg.lut3_12_dff15_setting);
  Serial.printf("%3d(0x%02X) : [BFH(0) 1531:1528(4)] dly_cnt6_clock_source_select\n", slgReg.dly_cnt6_clock_source_select, slgReg.dly_cnt6_clock_source_select);
  Serial.printf("%3d(0x%02X) : [BFH(4) 1535:1532(4)] cnt6_function_and_edge_mode_selection\n", slgReg.cnt6_function_and_edge_mode_selection, slgReg.cnt6_function_and_edge_mode_selection);
  Serial.printf("%3d(0x%02X) : [C0H(0) 1537:1536(2)] cnt6_initial_value_selection\n", slgReg.cnt6_initial_value_selection, slgReg.cnt6_initial_value_selection);
  Serial.printf("%3d(0x%02X) : [C0H(3) 1539:1539(1)] cnt6_output_pol_selection\n", slgReg.cnt6_output_pol_selection, slgReg.cnt6_output_pol_selection);
  Serial.printf("%3d(0x%02X) : [C0H(5) 1541:1541(1)] cnt6_cnt_mode_sync_selection\n", slgReg.cnt6_cnt_mode_sync_selection, slgReg.cnt6_cnt_mode_sync_selection);
  Serial.printf("%3d(0x%02X) : [C0H(6) 1542:1542(1)] cnt6_dly_edet_function_selection\n", slgReg.cnt6_dly_edet_function_selection, slgReg.cnt6_dly_edet_function_selection);
  Serial.printf("%3d(0x%02X) : [C1H(0) 1551:1544(8)] reg_cnt6_data\n", slgReg.reg_cnt6_data, slgReg.reg_cnt6_data);
  Serial.printf("%3d(0x%02X) : [C2H(5) 1557:1557(1)] cnt7_output_pol_selection\n", slgReg.cnt7_output_pol_selection, slgReg.cnt7_output_pol_selection);
  Serial.printf("%3d(0x%02X) : [C2H(7) 1559:1559(1)] cnt7_cnt_mode_sync_selection\n", slgReg.cnt7_cnt_mode_sync_selection, slgReg.cnt7_cnt_mode_sync_selection);
  Serial.printf("%3d(0x%02X) : [C3H(0) 1567:1560(8)] lut3_13_dff16_setting\n", slgReg.lut3_13_dff16_setting, slgReg.lut3_13_dff16_setting);
  Serial.printf("%3d(0x%02X) : [C4H(0) 1571:1568(4)] dly_cnt7_clock_source_select\n", slgReg.dly_cnt7_clock_source_select, slgReg.dly_cnt7_clock_source_select);
  Serial.printf("%3d(0x%02X) : [C4H(4) 1575:1572(4)] cnt7_function_and_edge_mode_selection\n", slgReg.cnt7_function_and_edge_mode_selection, slgReg.cnt7_function_and_edge_mode_selection);
  Serial.printf("%3d(0x%02X) : [C5H(0) 1577:1576(2)] cnt7_initial_value_selection\n", slgReg.cnt7_initial_value_selection, slgReg.cnt7_initial_value_selection);
  Serial.printf("%3d(0x%02X) : [C5H(2) 1578:1578(1)] cnt7_dly_edet_function_selection\n", slgReg.cnt7_dly_edet_function_selection, slgReg.cnt7_dly_edet_function_selection);
  Serial.printf("%3d(0x%02X) : [C6H(0) 1591:1584(8)] reg_cnt7_data\n", slgReg.reg_cnt7_data, slgReg.reg_cnt7_data);
  Serial.printf("%3d(0x%02X) : [C7H(0) 1592:1592(1)] io0_i2c_output_expander_data\n", slgReg.io0_i2c_output_expander_data, slgReg.io0_i2c_output_expander_data);
  Serial.printf("%3d(0x%02X) : [C7H(1) 1593:1593(1)] io0_i2c_output_expander_select\n", slgReg.io0_i2c_output_expander_select, slgReg.io0_i2c_output_expander_select);
  Serial.printf("%3d(0x%02X) : [C7H(2) 1594:1594(1)] io5_i2c_output_expander_data\n", slgReg.io5_i2c_output_expander_data, slgReg.io5_i2c_output_expander_data);
  Serial.printf("%3d(0x%02X) : [C7H(3) 1595:1595(1)] io5_i2c_output_expander_select\n", slgReg.io5_i2c_output_expander_select, slgReg.io5_i2c_output_expander_select);
  Serial.printf("%3d(0x%02X) : [C7H(4) 1596:1596(1)] io6_i2c_output_expander_data\n", slgReg.io6_i2c_output_expander_data, slgReg.io6_i2c_output_expander_data);
  Serial.printf("%3d(0x%02X) : [C7H(5) 1597:1597(1)] io6_i2c_output_expander_select\n", slgReg.io6_i2c_output_expander_select, slgReg.io6_i2c_output_expander_select);
  Serial.printf("%3d(0x%02X) : [C7H(6) 1598:1598(1)] io9_i2c_output_expander_data\n", slgReg.io9_i2c_output_expander_data, slgReg.io9_i2c_output_expander_data);
  Serial.printf("%3d(0x%02X) : [C7H(7) 1599:1599(1)] io9_i2c_output_expander_select\n", slgReg.io9_i2c_output_expander_select, slgReg.io9_i2c_output_expander_select);
  Serial.printf("%3d(0x%02X) : [C8H(1) 1601:1601(1)] i2c_reset_bit_with_reloading_nvm_into_data_register_soft_reset\n", slgReg.i2c_reset_bit_with_reloading_nvm_into_data_register_soft_reset, slgReg.i2c_reset_bit_with_reloading_nvm_into_data_register_soft_reset);
  Serial.printf("%3d(0x%02X) : [C8H(2) 1602:1602(1)] io_latching_enable_during_i2c_write_interface\n", slgReg.io_latching_enable_during_i2c_write_interface, slgReg.io_latching_enable_during_i2c_write_interface);
  Serial.printf("%3d(0x%02X) : [C9H(0) 1615:1608(8)] i2c_write_mask_bits\n", slgReg.i2c_write_mask_bits, slgReg.i2c_write_mask_bits);
  Serial.printf("%3d(0x%02X) : [CAH(0) 1619:1616(4)] i2c_slave_address\n", slgReg.i2c_slave_address, slgReg.i2c_slave_address);
  Serial.printf("%3d(0x%02X) : [CAH(4) 1620:1620(1)] slave_address_selection_a4\n", slgReg.slave_address_selection_a4, slgReg.slave_address_selection_a4);
  Serial.printf("%3d(0x%02X) : [CAH(5) 1621:1621(1)] slave_address_selection_a5\n", slgReg.slave_address_selection_a5, slgReg.slave_address_selection_a5);
  Serial.printf("%3d(0x%02X) : [CAH(6) 1622:1622(1)] slave_address_selection_a6\n", slgReg.slave_address_selection_a6, slgReg.slave_address_selection_a6);
  Serial.printf("%3d(0x%02X) : [CAH(7) 1623:1623(1)] slave_address_selection_a7\n", slgReg.slave_address_selection_a7, slgReg.slave_address_selection_a7);
  Serial.printf("%3d(0x%02X) : [CBH(0) 1631:1624(8)] pattern_id_byte_0\n", slgReg.pattern_id_byte_0, slgReg.pattern_id_byte_0);
  Serial.printf("%3d(0x%02X) : [E0H(0) 1793:1792(2)] register_read_selection_bits\n", slgReg.register_read_selection_bits, slgReg.register_read_selection_bits);
  Serial.printf("%3d(0x%02X) : [E0H(2) 1795:1794(2)] register_write_selection_bits\n", slgReg.register_write_selection_bits, slgReg.register_write_selection_bits);
  Serial.printf("%3d(0x%02X) : [E1H(0) 1801:1800(2)] nvm_configuration_selection_bits\n", slgReg.nvm_configuration_selection_bits, slgReg.nvm_configuration_selection_bits);
  Serial.printf("%3d(0x%02X) : [E2H(2) 1810:1810(1)] write_protect_register_enable\n", slgReg.write_protect_register_enable, slgReg.write_protect_register_enable);
  Serial.printf("%3d(0x%02X) : [E3H(0) 1820:1816(5)] page_selection_for_erase_erseb\n", slgReg.page_selection_for_erase_erseb, slgReg.page_selection_for_erase_erseb);
  Serial.printf("%3d(0x%02X) : [E3H(7) 1823:1823(1)] erase_enable\n", slgReg.erase_enable, slgReg.erase_enable);
  Serial.printf("%3d(0x%02X) : [E4H(0) 1824:1824(1)] protection_lock_bit_prl\n", slgReg.protection_lock_bit_prl, slgReg.protection_lock_bit_prl);

  Serial.println();
}

#endif
